var DATA =
{
    gequ:
    {
        language: "zh",
        nav: "歌曲",
        classification:
        {
            dalu:
            {
                nav: "大陆",
                header:
                {
                    h1: "大陆歌"
                },
                main:
                {
                    dxsh:
                    {
                        h2: "丹心似火（新谱置顶）",
                        preface:
                        [
                            "网友们都说《神探狄仁杰4之情花金人案》拍了老憨俄，但主题歌相当赞啊！", LB,
                            "确实，气势磅礴；歌词儿还蛮深奥俄！大有超越前作之势。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, Am], [5, EmB]],
                                [[1, CM7], [7, Em]],
                                [[1, Am], [5, EmB]],
                                [[1, FM7], [5, G], [7, Am]],
                                [[3, DmE], [7, GD]],
                                [[3, EmD], [7, Am]],
                                [[3, CM7], [7, Dm7]],
                                [[3, FM7], [7, Em]],
                                [[3, F], [5, GB], [7, Am]],
                                [[3, AmE], [5, GD], [7, Em]],
                                [[2, FM7], [4, Dm], [5, Em], [7, Em7]],
                                [[3, Asus4], [7, G], [9, Am]],
                                [[3, F], [5, GB], [7, Am]],
                                [[3, AmE], [5, GD], [7, Em]],
                                [[2, FM7], [4, Dm], [5, Em], [7, F]],
                                [[3, AmE], [7, Dsus2], [9, Am]],
                                [[1, Dm], [2, Em], [3, Am]]
                            ],
                            lyrics:
                            [
                                "夜凭栏 半月起",
                                "义薄云天仰美酒",
                                "破云烟 驱妖雾",
                                "坦荡胸襟忠魂住",
                                "头可断 命可弃",
                                "丹心热血参天地",
                                "辩是非 断心迷",
                                "横扫魔障奋马蹄",
                                "一声长啸震鬼蜮",
                                "大道青天任我去",
                                "俯瞰人间寻常里",
                                "雷霆怒吼霞光朗天地",
                                "一声长啸震鬼蜮",
                                "大道青天任我去",
                                "俯瞰人间寻常里",
                                "雷霆怒吼霞光朗天地",
                                "朗天地"
                            ]
                        },
                        postscript:
                        [
                            LB,
                            "第2段蛮难配的！", LB,
                            "Em7要满按。"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "...", PB,
                                "..."
                            ]
                        }
                    },
                    lsadm:
                    {
                        h2: "老鼠愛大米",
                        preface: "G调唱起来稍稍有点儿高？",
                        section:
                        {
                            chords:
                            [
                                [[3, G], [7, D], [11, Em], [15, FWS + C]],
                                [[2, G], [5, C], [8, Am7], [12, D7]],
                                [[3, G], [7, D], [11, Em], [15, Bm]],
                                [[3, C], [7, D], [10, G], [11, G]],
                                [[3, Bm], [7, Em], [11, C], [13, D], [15, G]],
                                [[3, Bm], [7, Em], [12, Am7], [16, D7]],
                                [[3, Bm], [7, Em], [11, C], [13, D], [15, G]],
                                [[3, Bm], [7, Em], [11, Am7], [12, Am7], [15, D7], [16, D7]],
                                [[3, G], [7, FWS + Em], [11, G], [15, Bm]],
                                [[3, C], [7, G], [12, Am], [16, D]],
                                [[3, G], [7, FWS + Em], [11, G], [15, Bm]],
                                [[3, C], [7, G], [13, Am], [14, D], [18, G], [20, G]]
                            ],
                            lyrics:
                            [
                                "我听见你的声音 有种特别的感觉",
                                "让我不断想 不敢再忘记你",
                                "我记得有一个人 永远留在我心中",
                                "哪怕只能够这样的想你",
                                "如果真的有一天 爱情理想会实现",
                                "我会加倍努力好好对你 永远不改变",
                                "不管路有多么远 一定会让它实现",
                                "我会轻轻在你耳边对你说 对你说",
                                "我爱你 爱着你 就像老鼠爱大米",
                                "不管有多少风雨 我都会依然陪着你",
                                "我想你 想着你 不管有多么的苦",
                                "只要能让你开心 我什么都愿意 这样爱你"
                            ]
                        },
                        postscript: "Am和Am7、D和D7有空时再看看……",
                        details:
                        {
                            comment:
                            [
                                "好像改成F调来唱的，但和弦还是用的G调，知道是怎么做到的吗？", PB,
                                "示范弹唱请参考",
                                [TAG.BoALP, "日语版", "uta", "nzmhkmgsk"],
                                "。"
                            ]
                        }
                    },
                    nndxf:
                    {
                        h2: "暖暖的幸福",
                        preface:
                        [
                            "开头第1句改了个字儿，为的是不和第2段重复，句意似乎也更恰当？", PB,
                            "高潮第1句中“喜欢”，字幕打的是“习惯”，不太对吧？", LB,
                            "反复听了好多遍，是“喜欢”呀？从歌词儿常规的套路来看，也应该是…… 而且“习惯”唱起来有点儿拗口？", PB,
                            "另外还有几个别字儿，一并改了。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, Cadd9], [5, FWS + C], [9, Cadd9], [13, G6], [17, C], [18, C]],
                                [[3, Cadd9E], [7, FWS + Am], [12, Cadd9], [16, FWS + G], [17, G]],
                                [[1, C], [5, FWS + CE], [9, Cadd9], [13, G6], [18, FWS + C], [19, C]],
                                [[3, AmE], [6, Am], [10, AmE], [13, G], [14, G]],
                                [[3, C], [6, GB], [12, Am], [14, Am7G]],
                                [[1, F], [5, CE], [8, F], [12, G]],
                                [[1, C], [4, GB], [10, Am], [13, Am7G]],
                                [[1, F], [5, G], [8, C]],
                                [[1, F], [5, G], [8, C]]
                            ],
                            lyrics:
                            [
                                "记得那一天 我们并肩走过红毯的浪漫",
                                "紧紧握着彼此的手 从此再没分开过",
                                "已是好多年 我们慢慢变得越来越像的脸",
                                "一半写着平凡 一半写着简单",
                                "喜欢静静地两个人 依偎在一起",
                                "哼难忘的情歌 聊脸红的秘密",
                                "暖暖地细数着 我们爱的默契",
                                "幸幸福福 走下去",
                                "幸幸福福 走下去"
                            ]
                        },
                        postscript:
                        [
                            LB,
                            "第3行的第1个C要满按，如果用满按的Cadd9就更好了；C/E最好也满按。", LB,
                            "Am/E的效果好像还不错哦？", LB,
                            "高潮部分是根据常规的套路来配的。", LB,
                            "总的来说，配得并不算很好……"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "“聊脸红的秘密”和“幸幸福福”，这两句分男女声部。", PB,
                                "这歌难度蛮大的！从低音的5到高音的5，音域跨度有两个8度。"
                            ]
                        }
                    },
                    nxhe:
                    {
                        h2: "那些花儿",
                        preface:
                        [
                            "当年流行的时候，曾找过谱子。觉得配得还不错，未加修改就搬过来了。", PB,
                            "女声唱的话，就照着范々姐的版本吧？不过和弦和弹法完全不同，不是单纯变个调儿就行了的！"
                        ],
                        section:
                        {
                            intro: [[1, G], [3, DFs], [5, Em], [7, C], [9, G], [11, D], [13, D7], [15, G]],
                            chords:
                            [
                                [[1, G], [5, DFs], [10, C], [15, G]],
                                [[1, G], [5, Em], [10, C], [15, D]],
                                [[1, G], [5, DFs], [10, Em], [14, C]],
                                [[1, G], [5, D], [10, D7], [14, G]],
                                [[2, G], [6, DFs]],
                                [[2, Em], [6, C]],
                                [[1, G], [5, D]],
                                [[2, D7], [6, G]],
                                [[1, G], [6, DFs], [11, Em], [16, Bm7]],
                                [[1, C], [6, G], [11, Em], [15, D]],
                                [[1, G], [6, DFs], [11, Em], [16, Bm7]],
                                [[1, C], [5, G], [10, D], [14, G]]
                            ],
                            lyrics:
                            [
                                "那片笑声让我想起 我的那些花儿",
                                "在我生命每个角落 静静为我开着",
                                "我曾以为我会永远 守在她身旁",
                                "今天我们已经离去 在人海茫茫",
                                "她们都老了吧",
                                "她们在哪里呀",
                                "幸运的是我",
                                "曾陪她们开放",
                                "啦啦啦啦 啦啦啦啦 啦啦啦 想她",
                                "啦啦啦啦 啦啦啦啦 她还在开吗",
                                "啦啦啦啦 啦啦啦啦 啦啦啦 去呀",
                                "她们已经被风吹走 散落在天涯"
                            ]
                        },
                        postscript:
                        [
                            "谱子不难背，主要就是前奏那套路子，略有不同而已。", PB,
                            "那时第一次接触",
                            [TAG.CHORD, DFs],
                            "，按得有点儿别扭！经过老师指点后，才发现…… 它还是蛮常用的。", LB,
                            "按Bm7时，食指要用力！"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "算是首比较容易唱的歌吧？"
                        }
                    },
                    nxqlzhk:
                    {
                        h2: "你笑起来真好看",
                        preface: "团里说要排练，就找来听了下——倒是蛮好听娥！",
                        section:
                        {
                            intro: [[1, C], [3, C]],
                            chords:
                            [
                                [[1, C], [5, G]],
                                [[1, Cadd9], [5, CE]],
                                [[1, Am], [5, CG]],
                                [[1, Dm7], [5, G]],
                                [[1, C], [5, G]],
                                [[1, AmC], [5, CG]],
                                [[1, F], [5, CG]],
                                [[1, Dm7], [5, C]],
                                [[2, C], [7, Gsus4]],
                                [[2, Am], [7, CG]],
                                [[2, F], [8, CG]],
                                [[1, Dsus2], [5, G]],
                                [[2, C], [7, Gsus4]],
                                [[2, Am7], [6, CG]],
                                [[1, F], [5, CG]],
                                [[1, Dsus2], [3, Gsus4], [5, C]]
                            ],
                            lyrics:
                            [
                                "想去远方的山川",
                                "想去海边看海鸥",
                                "不管风雨有多少",
                                "有你就足够",
                                "喜欢看你的嘴角",
                                "喜欢看你的眉梢",
                                "白云挂在那蓝天",
                                "像你的微笑",
                                "你笑起来真好看",
                                "像春天的花一样",
                                "把所有的烦恼 所有的忧愁",
                                "统统都吹散",
                                "你笑起来真好看",
                                "像夏天的阳光",
                                "整个世界全部的时光",
                                "美得像画卷"
                            ]
                        },
                        postscript:
                        [
                            "前奏和高潮第1个C都要满按。", PB,
                            "看似挺简单的旋律，但配起和弦来还真不简单！现在的结果也不尽如人意，等有机会问问其他团友。"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment: "..."
                        }
                    },
                    zyssg:
                    {
                        h2: "子夜四时歌",
                        preface:
                        [
                            "要用吴语来演唱，否则不好听！", LB,
                            "多听听原唱，模仿她们的发音。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, Dm], [2, Em], [3, Cadd9], [5, Am]],
                                [[1, F], [5, Em]],
                                [[1, C], [3, Cadd9], [5, Dm]],
                                [[1, AmC], [3, Dm7], [5, Am]],
                                [[1, Dm], [2, Em], [3, Cadd9], [5, Am]],
                                [[1, F], [3, F], [5, Em], [6, Em]],
                                [[1, C], [2, CE], [3, Cadd9], [5, Dm]],
                                [[1, AmC], [3, Dm7], [5, Am]],
                                [[1, Dm], [2, Em], [3, Cadd9], [5, Am]],
                                [[1, F], [5, Em]],
                                [[1, C], [3, Cadd9], [5, Dm]],
                                [[1, AmC], [3, Dm7], [5, Am]],
                                [[1, Dm], [2, Em], [3, Cadd9], [5, Am]],
                                [[1, F], [3, F], [5, Em], [6, Em]],
                                [[1, C], [2, CE], [3, Cadd9], [5, Dm]],
                                [[1, AmC], [3, Dm7], [5, Am]]
                            ],
                            lyrics:
                            [
                                "春林花多媚",
                                "春鸟意多哀",
                                "春风复多情",
                                "吹我罗裳开",
                                "朝登凉台上",
                                "夕宿兰池里",
                                "乘月采芙蓉",
                                "夜夜得莲子",
                                "仰头看桐树",
                                "桐花特可怜",
                                "愿天无霜雪",
                                "梧子解千年",
                                "渊冰厚三尺",
                                "素雪复千里",
                                "我心如松柏",
                                "君情复何似"
                            ]
                        },
                        postscript:
                        [
                            "Am/C的效果还不错哦？", PB,
                            "第1和第2段略有不同，只想求变，3、4同理。若嫌麻烦，择其一即可。"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment: "电视剧中有个老头子乱叫，使得本曲没有完美版的！"
                        }
                    }
                }
            },
            xianggang:
            {
                nav: "香港",
                header:
                {
                    h1: "香港歌"
                },
                main:
                {
                    ffz:
                    {
                        h2: "放风筝（新谱置顶）",
                        preface:
                        [
                            "网上只找到一个",
                            [TAG.a, "网页", "https://zhidao.baidu.com/question/651740046295640485.html"],
                            "与本曲有关，歌词也是从那儿抄来的。（缺少最后一段）"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, C], [4, C]],
                                [[1, Cadd9], [6, G6]],
                                [[1, Dm], [5, F]],
                                [[1, G], [6, C]],
                                [[1, C], [4, C]],
                                [[1, Cadd9], [6, G6]],
                                [[1, Dm], [5, F]],
                                [[1, G], [6, C]],
                                [[1, Em], [5, Dsus2]],
                                [[1, CM7], [6, AmB]],
                                [[1, FM7], [5, CE]],
                                [[1, Dm7], [5, G]],
                                [[1, C], [4, C]],
                                [[1, Cadd9], [6, G]],
                                [[1, Dm], [5, F]],
                                [[1, G], [6, C]]
                            ],
                            lyrics:
                            [
                                "结伴去放风筝儿",
                                "似风筝真正很自由",
                                "用双手怀抱日后",
                                "说笑声齐合奏",
                                "你共我永不忧愁",
                                "似风筝天际快乐游",
                                "用真心齐向上望",
                                "哪怕艰难没有",
                                "飞飞飞 好欢喜",
                                "这世界是个乐园地",
                                "有你和我天天嬉戏",
                                "好玩到飞起",
                                "你共我永不忧愁",
                                "似风筝天际快乐游",
                                "（愿彼此……",
                                "………………）"
                            ]
                        },
                        postscript:
                        [
                            "开头连弹仨C也行，用add9是为了求变。", LB,
                            "副歌中尝试着用了Am/B！效果好像还不错哦？", LB,
                            "最后1段的第2句中换掉了G6，是因为改了点儿旋律。哪个好些？"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep.5 11:56.0 ~ 12:54.9 (not recorded!!!)
                            comment:
                            [
                                "……", PB,
                                "……"
                            ]
                        }
                    },
                    ahdgs:
                    {
                        h2: "阿花的故事",
                        preface: "每段的第1句蛮好听的，唱起来很有味道，听起来意犹未尽。",
                        section:
                        {
                            chords:
                            [
                                [[1, C], [3, Cadd9], [6, C], [9, G]],
                                [[1, Cadd9E], [4, Am], [8, Dm7], [12, G]],
                                [[1, Dsus4], [3, F], [7, D7sus4], [11, Em]],
                                [[1, F], [3, Dm7C], [7, Am7G], [9, G]]
                            ],
                            lyrics:
                            [
                                "名字叫阿花摇着尾巴",
                                "它只喝牛奶哪日跟我在喝茶",
                                "陪我读书偷懒从来无责骂",
                                "夜晚阿花专爱梁上爬"
                            ]
                        },
                        postscript:
                        [
                            "开头连弹仨C也行，用add9是为了求变。", LB,
                            "第2句尝试着用了Cadd9/E！效果好像还不错哦？", LB,
                            "还有两处也用了转音和弦。"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "乍一听，总觉得最后一句应该回到DO来结尾？至少最后一段要返回，前几段可以以低音的SO结束，毕竟后面还有。", LB,
                                "但是这一点作曲者肯定也想到的……", LB,
                                "家母说就是要避免俗套！", LB,
                                "唱多了之后，SO结尾好像是挺顺口的，回到DO反而有点儿怪？你觉得呢？"
                            ]
                        }
                    },
                    cchr:
                    {
                        h2: "叱咤红人",
                        preface:
                        [
                            "G调唱起来稍稍有点儿高？", PB,
                            "选了几句第2段的歌词儿，放至第1段来唱。唱这歌儿无非就是对韦小宝艳福的憧憬……", LB,
                            "原版因为唱两段，最后一句从“我冇胆”到“你够胆”，倒还真不错；唱一遍的话，好像很窝囊哦？所以改词儿了！"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, G], [8, FWS + Em]],
                                [[1, Am], [8, FWS + D]],
                                [[1, C], [7, G]],
                                [[1, Am7], [6, FWS + D7]],
                                [[4, Bm], [8, Em]],
                                [[1, Am7], [5, FWS + D]],
                                [[4, Bm], [8, Em]],
                                [[1, Am7], [6, D7]],
                                [[1, G], [6, Em]],
                                [[2, Am7], [8, FWS + D7]],
                                [[3, G], [8, Em]],
                                [[4, C], [11, D], [17, Em], [18, Em]],
                                [[2, C], [6, D], [8, G]]
                            ],
                            lyrics:
                            [
                                "求其横掂做人最易",
                                "搭够当真自然之至",
                                "小流氓 变叱咤红人",
                                "搞搞震便当真",
                                "时运最高 任佢天冧落嚟",
                                "自会有新计",
                                "情分满泻 让我娶足七个",
                                "未会算多 齐共我唱歌",
                                "智慧 加啲气势",
                                "想要世界调转 亦未係难事",
                                "加啲放肆 加啲创意",
                                "一身充满少壮傲气 想痛快抉择博一次",
                                "我梗係放尽够胆试"
                            ]
                        },
                        postscript:
                        [
                            LB,
                            "D或D7都是凭感觉配的，好像还算和谐？等有空时再力求配得更精确些……"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "朋友们都说唱得蛮好……" + EMOJI.awkward, PB,
                                "好像改成F调来唱的，但和弦还是用的G调，知道是怎么做到的吗？"
                            ]
                        }
                    }
                }
            },
            taiwan:
            {
                nav: "台湾",
                header:
                {
                    h1: "台湾歌"
                },
                main:
                {
                    ldxyq:
                    {
                        h2: "绿岛小夜曲（新谱置顶）",
                        preface:
                        [
                            "这是首情歌，女歌手如果也唱“姑娘”，似乎不太恰当噢？", LB,
                            "与之对应的词儿呢，首先想到的肯定是“小伙”，但这样唱好像老憨娥哦？", LB,
                            "听纪老师说：“那个姑娘改为情郎！”嗯，改得完美！甄老师也是这么唱的。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[2, G], [4, GA], [10, G], [15, D]],
                                [[1, Em], [5, GA], [10, Asus4], [15, D]],
                                [[1, CM7], [6, G], [11, Am7], [17, D7]],
                                [[1, G], [6, Am7], [11, D6], [17, G]],
                                [[1, CM7], [8, Am7], [14, D7]],
                                [[1, G], [7, Am7], [12, D]],
                                [[2, EmD], [8, D]],
                                [[1, EmB], [6, GA], [11, CM7], [14, G]]
                            ],
                            lyrics:
                            [
                                "这绿岛像一只船 在月夜里摇呀摇",
                                "姑娘哟 你也在我的心海里飘呀飘",
                                "让我的歌声随那微风 吹开了你的窗帘",
                                "让我的衷情随那流水 不断地向你倾诉",
                                "椰子树的长影 掩不住我的情意",
                                "明媚的月光更照亮了我的心",
                                "这绿岛的夜已经这样沉静",
                                "姑娘哟 你为什么还是默默无语"
                            ]
                        },
                        postscript:
                        [
                            "配完和弦后，发现自己的水平有了很大的提高！", LB,
                            "能够用上挂4加6大7，真的很开心！", LB,
                            "难怪这歌儿的曲风有点儿特别？", PB,
                            "最纠结的是G/A，斟酌了好久，也考虑过Gadd9，哪个好点儿？", LB,
                            "Em/D的效果相当好啊？"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep.14 23:42.5 ~ 25:14.8
                            comment:
                            [
                                "应该是演员本人唱的，杨老师也是有名的歌手！", PB,
                                "唱得好不好，就听第1句。更确切地说，就听第3个字——岛！" +
                                "不是单纯一个“岛”字儿，后面要“哦噢喔”！没有转音或是转不来的，那都属于唱得差的。这就好比批考卷，第一步错了，阅卷老师直接一个×就上去了，后面就不看了。", LB,
                                "同样地，“摇呀摇”和“飘呀飘”的“呀”，最好也转一下。不过和“岛”相比，就没那么明显、那么重要了。", LB,
                                "有些版本里“那微风”或“吹开了”也…… 看歌手自己发挥了。", PB,
                                "示范弹唱请参考",
                                [TAG.BoALP, "日语版", "uta", "otmgkrnamgfr"],
                                "。"
                            ]
                        }
                    },
                    cf:
                    {
                        h2: "春风",
                        preface:
                        [
                            "因为是完全按照“陈天贵”的表演来记谱的，所以选用了F调。", LB,
                            "如果你觉得有难度，不如改成G调的和弦？当然，前提是你能再唱高一个音！"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[2, F], [4, F], [6, FWS + Am], [8, A7], [10, Gm], [12, Gm], [14, FWS + Dm], [16, Dm]],
                                [[2, F], [4, F], [6, FWS + Am], [8, A7], [10, Gm], [12, C7], [15, F], [16, F]],
                                [[3, bB], [5, bB], [8, F], [9, C7], [12, bB], [14, bB], [17, F], [18, C]],
                                [[3, F], [5, F], [7, FWS + Am], [9, A7], [11, Gm], [13, C7], [16, F]]
                            ],
                            lyrics:
                            [
                                "春风快加紧脚步 快到我窗前漫舞",
                                "春风请穿过门缝 请在我脸上轻吻",
                                "越过那千层的山峰 带给我亲切的问候",
                                "今年我们又再相逢 请给我新的祝福"
                            ],
                            outro: [[1, bB], [2, C], [3, F]]
                        },
                        postscript:
                        [
                            "F和",
                            [TAG.CHORD, bB],
                            "还是用大横按比较好。指力强劲的网友，如果能用双横按来按",
                            [TAG.CHORD, bB],
                            "，那当然最好！", LB,
                            "尾奏中的C最好也大横按，这样换弦方便些。"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep.19 4:31.2 ~ 5:20.9
                            comment:
                            [
                                "澎老师唱得真好啊，琴弹得更好！", PB,
                                "大拇指扫弦？这个手法没看懂……", LB,
                                "第3句里的C7似乎不是很好？而且换弦也不太方便。不如把前一个F再弹一次？"
                            ]
                        }
                    },
                    ydgz:
                    {
                        h2: "一代公主",
                        preface: "《一代女皇》就不提供了。",
                        section:
                        {
                            chords:
                            [
                                [[0, Am], [3, Em]],
                                [[0, Am], [3, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                                [[0, Am], [3, Em]],
                                [[0, Am], [3, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                                [[1, Dm7], [5, Am], [9, Em], [10, Em]],
                                [[1, Am], [5, Am7], [8, FWS + Dm], [10, Dm]],
                                [[1, Dm7], [5, EmB], [8, GB], [10, GB]],
                                [[1, Dm7], [5, D6], [8, FWS + G], [10, G]],
                                [[0, Am], [5, Em]],
                                [[0, Am], [5, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]]
                            ],
                            lyrics:
                            [
                                "峨眉 耸参天",
                                "丰颊 满光华",
                                "器宇非凡 是慧根",
                                "唐朝女皇 武则天",
                                "皓腕 刚毅扬",
                                "慧智 兰心巧",
                                "玉纤香动 万卷书",
                                "一代公主 封太平",
                                "春晖普照 溢满宫锦",
                                "女袭母风 展露威仪",
                                "寸寸柔肠 盈盈粉泪",
                                "冷暖人间 恩情几许",
                                "盘踞天下 数十年",
                                "郁郁笙歌 愈寂寥",
                                "两面评价 在人间",
                                "唐朝轶事 永流传"
                            ]
                        },
                        postscript: "最开心的是，能配上D6了耶！",
                        details:
                        {
                            demo: TAG.audio,
                            comment: "男声唱总是很怪哦？其实除了金老师，其他人唱出来都有点儿怪的。"
                        }
                    }
                }
            },
            xinjiapo:
            {
                nav: "新加坡",
                header:
                {
                    h1: "新加坡歌／新谣"
                },
                main:
                {
                    cxcwcyd:
                    {
                        h2: "财兴财旺财运到（新谱置顶）",
                        preface: "原歌词倒数第2句太消极了，改之。",
                        section:
                        {
                            chords:
                            [
                                [[1, C], [9, C]],
                                [[1, Am], [9, Em]],
                                [[1, Dm7], [9, Dm7]],
                                [[1, F], [3, G], [7, C]],
                                [[3, C], [9, Am]],
                                [[3, C], [9, G]],
                                [[2, Fadd9], [7, CE]],
                                [[2, Dm7], [10, G]],
                                [[2, C], [8, Am]],
                                [[3, C], [10, G]],
                                [[2, Fadd9], [7, CE]],
                                [[3, F], [9, G]],
                                [[1, C], [8, Cadd9]],
                                [[1, Am], [9, Em]],
                                [[1, Dm7], [8, Em], [12, Am]],
                                [[1, Dm7], [7, G]],
                                [[1, C], [8, Cadd9]],
                                [[1, Am], [9, Em]],
                                [[1, Dm7], [8, Em], [12, Am]],
                                [[1, F], [5, G], [7, C]],
                                [[1, F], [3, G], [7, C]]
                            ],
                            lyrics:
                            [
                                "财兴财旺财运到 添福添贵添元宝",
                                "啦啦啦啦啦啦啦啦啦",
                                "财兴财旺财运到 添福添贵添元宝",
                                "啦啦啦啦啦啦啦",
                                "反正无事就下凡来陪你走一遭",
                                "人间缭乱着喧腾热闹",
                                "金银财宝轻轻随手一掏",
                                "我有求必应只怕你嫌少",
                                "安平乐道你仍为一袋米折腰",
                                "利字当前他两肋不插刀",
                                "身缠万贯能否换得一笑",
                                "问苍天 天也不知晓",
                                "钱海大浪涛涛 人心左右摇",
                                "摇向柳暗花明艳阳照",
                                "坐看白云飘飘 快乐自己找",
                                "好山好水好围绕",
                                "钱海大浪涛涛 人心来回闹",
                                "闹出两行眼泪犯不着",
                                "坐看白云飘飘 今生不无聊",
                                "财兴财旺财运到",
                                "啦啦啦啦啦啦啦"
                            ]
                        },
                        postscript:
                        [
                            LB,
                            "尝试着用了Fadd9！也考虑过",
                            [TAG.CHORD, FM7],
                            "，哪个好点儿？或者说别花哨了，直接F得了。", LB,
                            "高潮中的第2个和弦，也考虑过G、G/B、C/G…… 但好像还是Cadd9的效果最好？另外，换弦也方便。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "旋律轻快活泼，歌词朗朗上口！第一次看《财星高照》时就欢喜这歌儿了。", LB,
                                "原唱黄老师前几年……" + EMOJI.cry, PB,
                                "以前觉得黄老师唱得一般，不过也可以理解，毕竟他不是专业歌手。", LB,
                                "现在自己尝试后才发现其实蛮难唱的，音域跨度很大！" +
                                "最低的低至低音5；最高的高到高音2。如果前奏也自己来，那得唱到高音3！"
                            ]
                        }
                    },
                    djdg:
                    {
                        h2: "对酒当歌",
                        preface: "C调唱起来有点儿低？若改弹D调的和弦呢，好像又有点儿怪？建议用变调夹。",
                        section:
                        {
                            chords:
                            [
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, Am]],
                                [[1, G], [7, C]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, Am]],
                                [[1, G], [7, C], [8, C7]],
                                [[1, Dm7], [6, Em]],
                                [[1, F], [6, FWS + C]],
                                [[1, Dm7], [6, Em]],
                                [[1, F], [7, G]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, F]],
                                [[1, G], [7, C]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, F]],
                                [[1, G], [7, C]]
                            ],
                            lyrics:
                            [
                                "路遥遥行遍万里山河",
                                "会知心能有几个",
                                "刀剑里笑看风云变色",
                                "谁胜谁负谁晓得",
                                "浪滔滔数尽悲欢离合",
                                "放得下能有几个",
                                "邀清风明月对酒当歌",
                                "醉三分悠然自得",
                                "不管今夕身处于何方",
                                "酒入肠豪情万丈",
                                "尽管世俗仍笑我痴狂",
                                "恩或怨都由我扛",
                                "天苍苍豪情气壮山河",
                                "得与失又算什么",
                                "刀剑里笑看风云变色",
                                "我行我素我自乐",
                                "人匆匆犹如红尘过客",
                                "名和利又算什么",
                                "邀清风明月对酒当歌",
                                "醉一回人生几何"
                            ]
                        },
                        postscript: "Dm和Dm7差不多，主要是想有点儿变化。嫌麻烦的话，选择其一即可。",
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "手头没有变调夹，只好弹D调了，改了几个和弦。", PB,
                                "想唱出那种洒脱的感觉，结果显得很杂耍" + EMOJI.awkward, LB,
                                "等心情好时再重录一次。"
                            ]
                        }
                    },
                    hqxjh:
                    {
                        h2: "豪情笑江湖",
                        preface: "主歌用A小调；副歌用C大调。",
                        section:
                        {
                            chords:
                            [
                                [[1, Am], [6, Dm]],
                                [[1, Cadd9], [5, Am]],
                                [[1, Am], [6, Em]],
                                [[1, DmF], [7, Em]],
                                [[1, Am], [7, sFm]],
                                [[1, F], [6, Am], [7, Em]],
                                [[1, Am], [7, GB]],
                                [[1, F], [7, G]],
                                [[3, C], [9, GB]],
                                [[3, Am], [9, Em]],
                                [[1, F], [7, EmB]],
                                [[1, Dm7], [7, G]],
                                [[3, C], [9, GB]],
                                [[3, Am], [9, Em]],
                                [[1, FM7], [7, EmB]],
                                [[1, Dm7], [5, G], [7, C]]
                            ],
                            lyrics:
                            [
                                "滚滚巨浪 红尘纷乱",
                                "淘尽英雄汉",
                                "笑里藏刀 人心难料",
                                "无奈世态皆炎凉",
                                "知音难寻访 痴心愁断肠",
                                "多情总被无情伤",
                                "风云多变幻 缘聚又缘散",
                                "浮生若梦一场欢",
                                "人生漫漫漫漫路遥长",
                                "看透繁华落尽见真章",
                                "豪情肝胆照 千杯醉难倒",
                                "伴我逐浪迎风笑",
                                "人生漫漫漫漫路遥长",
                                "看透繁华落尽见真章",
                                "豪情肝胆照 千杯醉难倒",
                                "伴我逐浪迎风笑"
                            ]
                        },
                        postscript:
                        [
                            "尝试着用了Cadd9！效果好像还不错哦？最初拆成C和Dm7来演奏过，也是个不错的选择吧？", LB,
                            "把Dm/F有点儿难按，换成Dm7或F也行、拆成",
                            [TAG.CHORD, FM7],
                            "和Dm也行。", LB,
                            [TAG.CHORD, sFm],
                            "还有待推敲！其它候选的有",
                            [TAG.CHORD, DFs],
                            "、",
                            [TAG.CHORD, D7Fs],
                            "……", LB,
                            "第6句里的Am和Em，用一个Am代替也行。不过此处用5级和弦来结束似乎更合理？但若合成一个Em/A又有点儿怪哦？所以就拆开吧！", LB,
                            "高潮前最后的G用大横按比较好。", LB,
                            "高潮第2遍里用了",
                            [TAG.CHORD, FM7],
                            "，是为了和第1遍有所区别。其实用F也行。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "唱错一个字儿，妈的！", LB,
                                "第2次高潮的第1句，怎么唱得跟走音似的？", LB,
                                "算了，以后再说了。"
                            ]
                        }
                    },
                    mtdfx:
                    {
                        h2: "明天的方向",
                        preface: "因为赶时间，就凭经验、凭感觉配了，好像还算和谐？",
                        section:
                        {
                            chords:
                            [
                                [[0, C], [4, GB], [9, Am], [12, FWS + Em]],
                                [[1, F], [7, CE], [11, Dm7], [12, FWS + G]],
                                [[0, C], [4, GB], [8, Am], [12, FWS + Em]],
                                [[1, F], [4, CE], [8, Dm7], [11, FWS + G]],
                                [[0, C], [4, GB], [8, Am], [12, FWS + Em]],
                                [[1, F], [7, CE], [10, Dm7], [11, FWS + G]],
                                [[0, C], [4, GB], [8, Am], [12, FWS + Em]],
                                [[1, F], [5, CE], [9, Dm7], [11, G], [13, FWS + C]],
                                [[0, C7], [4, F], [8, G], [12, FWS + C]],
                                [[0, C7], [4, FWS + F], [8, FWS + F], [10, G], [12, FWS + C]],
                                [[0, C7], [4, F], [8, G], [12, FWS + Em]],
                                [[0, Am], [3, D7], [7, F], [9, G], [13, C]],
                                [[0, C], [3, D7], [7, F], [9, G], [13, C]]
                            ],
                            lyrics:
                            [
                                "你我他肩并肩走在人生路上",
                                "去实现千百个幻梦中的理想",
                                "旅途中乐意接受无数的挑战",
                                "年轻的心灵才能逐渐成长",
                                "偶尔要面对失意挫折又何妨",
                                "让彼此一同把感受来分担",
                                "生活里不可缺少冲击的力量",
                                "有充实的生命才会活得不平凡",
                                "青春的骄傲写在朝气的脸庞",
                                "年少的喜悦常在眼波中流转",
                                "真挚的情感就是灿烂的阳光",
                                "留在心上照亮我们明天的方向",
                                "留在心上照亮我们明天的方向"
                            ]
                        },
                        postscript:
                        [
                            LB,
                            "以前看别人配的和弦中，C/E出现的频率还蛮高的。当时挺纳闷：直接用C不就得了，转了E好像有点儿怪爱？现在似乎明白了，自己也尝试着用了。", LB,
                            "最满意的是C7！", LB,
                            "高潮第2句也别花哨了，用和前1句一样的和弦，好像也是个不错的选择？"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "方便起见，最后两句唱成一样的调儿，和原曲不一样。"
                        }
                    }
                }
            }
        }
    },
    uta:
    {
        language: "ja",
        nav: "うた",
        header:
        {
            h1: "日本語の歌"
        },
        main:
        {
            otmgkrnamgfr:
            {
                h2: "乙女心に雨が降る（新着）",
                preface:
                [
                    "演歌らしい" + EMOJI.surprise, PB,
                    "女性が歌えば、キーCで大丈夫なはずだ。"
                ],
                section:
                {
                    chords:
                    [
                        [[2, G + FWS], [4, GA + FWS], [7, FWS + G], [11, FWS + D]],
                        [[1, Em + FWS], [4, GA], [8, FWS + FWS + Asus4], [12, FWS + D]],
                        [[1, CM7], [7, G], [11, Am7], [15, D7]],
                        [[1, G], [6, Am7], [11, D6 + FWS], [14, G]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌 歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞詞",
                        "ななななななななな ななななな",
                        "しししし しししし しししし"
                    ]
                },
                postscript: "コードを付けてみてから、編曲が上達したような気がする" + EMOJI.shy,
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "オリジナルは",
                        [TAG.BoALP, "ここ", "gequ/taiwan", "ldxyq"],
                        "をクリックして！"
                    ]
                }
            },
            nzmhkmgsk:
            {
                h2: "ねずみは米がすき",
                preface:
                [
                    "日本の曲みたいわ！", PB,
                    "キーGで歌うなんて難しいかな？"
                ],
                section:
                {
                    chords:
                    [
                        [[3, G], [7, D], [11, Em], [15, FWS + C]],
                        [[3, G], [6, C], [9, Am7], [13, D7]],
                        [[2, G], [6, D], [10, Em], [14, Bm]],
                        [[1, FWS + C], [6, D], [8, G], [9, G]],
                        [[3, Bm], [6, Em], [9, C], [10, FWS + FWS + D], [12, G]],
                        [[2, Bm], [5, Em], [9, Am7 + FWS], [12, D7]],
                        [[3, Bm], [7, Em], [10, C], [11, FWS + FWS + D], [13, G]],
                        [[3, Bm], [6, FWS + Em], [10, Am7], [11, Am7], [15, D7], [16, D7]],
                        [[5, G], [10, FWS + Em], [14, G], [18, Bm]],
                        [[3, C], [6, G], [10, Am], [14, D]],
                        [[6, G], [11, FWS + Em], [15, G], [19, Bm]],
                        [[3, C], [7, G], [12, Am], [14, D], [18, G], [21, G]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞詞",
                        "なななななな ななななななな",
                        "しししししししし",
                        "歌歌歌歌歌歌 歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞詞",
                        "ななななななな ななななな",
                        "しししししししししし しししし",
                        "歌歌歌歌歌歌 歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞詞詞",
                        "ななななななな ななな ななななななな",
                        "ししししししし しししししし ししししし"
                    ]
                },
                postscript: "Am、Am7、DとD7は再検討……",
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "キーFで歌ったけど、上記どおりキーGのコードで弾いた……", LB,
                        "（手元にカポがない）", PB,
                        "オリジナルは",
                        [TAG.BoALP, "ここ", "gequ/dalu", "lsadm"],
                        "をクリックして！"
                    ]
                }
            },
            hdmrnut:
            {
                h2: "ひだまりの詩",
                preface: "曲名が読めるの？",
                section:
                {
                    chords:
                    [
                        [[2, C], [4, E7], [7, Am]],
                        [[1, EmG], [5, F], [7, G7], [11, C], [14, C]],
                        [[2, C], [4, E7], [6, Am]],
                        [[2, EmG], [6, F], [9, G7], [12, C], [13, C]],
                        [[1, FWS + C], [3, E7], [6, Am]],
                        [[2, AmG], [6, F], [8, FWS + G7], [12, C], [13, C]],
                        [[1, FWS + C], [3, E7 + FWS], [6, Am]],
                        [[1, FWS + AmG], [3, D7Fs], [6, Gsus4], [8, G7], [10, G7]],
                        [[1, C], [3, Dm7], [5, Em7 + FWS], [8, E7Gs], [10, FWS + Am], [13, EmG], [15, FWS + F], [18, FmM7]],
                        [[1, C], [3, Am], [5, FWS + Dm7], [9, Gsus4]],
                        [[1, Em7], [3, Am], [5, FWS + Dm7], [9, Gsus4]],
                        [[1, Em7], [3, Am], [5, Dm7], [9, Gsus4], [11, C]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌",
                        "詞詞詞詞詞 詞詞詞詞詞詞詞",
                        "なななななな",
                        "しししししし ししししし",
                        "歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞",
                        "なななななな",
                        "ししし しししししし",
                        "歌歌歌歌歌歌歌歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞 詞詞詞詞詞詞",
                        "ななな なななななな",
                        "ししし ししししししし"
                    ]
                },
                postscript:
                [
                    [TAG.CHORD, E7Gs],
                    "は完璧だがね！", LB,
                    "最後のFは、標準的に押したほうがええ。他には代理コードでやってもええ。"
                ],
                details:
                {
                    demo: TAG.audio,
                    comment: "ガッキーに「よく知っとる」と言いたかったが、逆にそう言われた……"
                }
            }
        }
    },
    song:
    {
        language: "en",
        nav: "Song",
        classification:
        {
            uk:
            {
                nav: "UK",
                header:
                {
                    h1: "British Songs"
                },
                main:
                {
                    sh:
                    {
                        h2: "Summer Holiday (not finished!)",
                        preface: "I was not interested in it though I had heard it before. But this time...",
                        section:
                        {
                            chords:
                            [
                                [[1, G], [11, CM7], [21, Am7], [29, D]],
                                [[0, G], [9, CM7], [22, Am7], [31, D]],
                                [[1, G], [9, CM7], [24, Am7], [32, D]],
                                [[1, Am7], [9, D], [21, G], [27, Bm], [29, bBm], [32, Am7], [39, D], [47, G]],
                                [[7, Am7], [23, D], [34, G]],
                                [[7, Am7], [23, D], [30, G]],
                                [[1, Bm], [11, CM7], [21, Am7], [29, D]],
                                [[0, G], [9, CM7], [22, D]],
                                [[1, G], [6, CM7], [16, Am7], [24, D]],
                                [[0, G], [7, CM7], [25, Am7], [33, D]],
                                [[4, G], [10, CM7], [20, Am7], [28, D]],
                                [[4, Am7], [9, D], [21, G], [27, Bm], [29, bBm], [32, Am7], [36, D], [43, G]]/////
                            ],
                            lyrics:
                            [
                                "We're all going on a summer holiday",
                                "No more working for a week or two",
                                "Fun and laughter on our summer holiday",
                                "No more worries for me or you   For a week or two",
                                "We're going where the sun shines brightly",
                                "We're going where the sea is blue",
                                "We've all seen it on the movies",
                                "Now let's see if it's true",
                                "Everybody has a summer holiday",
                                "Doin' things they always wanted to",
                                "So we're going on a summer holiday",
                                "To make our dreams come true   For me and you"
                            ]
                        },
                        postscript:
                        [
                            [TAG.CHORD, bBm],
                            " is perfect, isn't it?"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "In Episode 8 of ",
                                [TAG.q, "Armed Reaction II"],
                                " I heard this song, sung by YAO."
                            ]
                        }
                    }
                }
            }
        }
    },
    phelng:
    {
        language: "th",
        nav: "เพลง",
        header:
        {
            h1: "เพลงไทย"
        },
        main:
        {
            kg:
            {
                h2: "คู่กัด",
                preface:
                [
                    "I had not expected that it is a Thai song. " +
                    "I found the original 25 years later" + EMOJI.surprise
                ],
                section:
                {
                    intro: [[1, F], [3, Dm], [5, Gm], [7, C7], [9, F], [11, Dm], [13, Gm], [15, C7]],
                    chords:
                    [
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, Gm], [9, C7]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, Gm], [6, C7], [9, F]],
                        [[4, bB], [11, bB]],
                        [[3, F], [10, F]],
                        [[3, bB], [10, bB]],
                        [[2, C], [8, C7]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, Gm], [6, C7], [9, F]],
                        [[3, Gm], [6, C7], [9, F]]
                    ],
                    lyrics:
                    [
                        "她总是只留下电话号码",
                        "从不肯让我送她回家",
                        "听说你也曾经爱上过她",
                        "曾经也同样无法自拔",
                        "你说你学不会假装潇洒",
                        "却叫我别太早放弃她",
                        "把过去传说成一段神话",
                        "然后笑彼此一样的傻",
                        "我们这么在乎她 却被他全部抹煞",
                        "越疼她越伤心 永远得不到回答",
                        "到底她怎么想 应该继续猜测吗",
                        "还是说好全抛了吧",
                        "找一个承认失恋的方法",
                        "让心情好好的放个假",
                        "当你我不小心又想起她",
                        "就在记忆里画一个叉",
                        "就在记忆里画一个叉"
                    ]
                },
                postscript:
                [
                    LB,
                    "At my home, there is a song book containing ",
                    [TAG.q, "Rival"],
                    ". It is easy to remember all of the chords.", PB,
                    "Change to C Key if F is difficult for you."
                ],
                details:
                {
//                    demo: TAG.audio,
                    comment:
                    [
                        "While I was watching Taiwanese TV series, Suddenly I found that the composer's name was ",
                        [TAG.q, "Cha Tri Kongsuwan"],
                        "!"
                    ]
                }
            }
        }
    },/*
    lied:
    {
        language: "de",
        nav: "Lied",
        classification:
        {}
    },
    chanson:
    {
        language: "fr",
        nav: "Chanson",
        classification:
        {}
    },*/
    lat:
    {
        language: "sv",
        nav: "Låt",
        header:
        {
            h1: "Svenska Sånger"
        },
        main:
        {
            sitr:
            {
                h2: "Sunshine in the Rain",
                preface:
                [
                    "I had not expected that it is a Swedish song, the original of a Chinese cover version named ",
                    [TAG.q, "Sun Will Never Set"],
                    ".", PB,
                    "I have changed 4 cities."
                ],
                section:
                {
                    intro: [[1, G], [3, Am], [5, D7], [7, G]],
                    chords:
                    [
                        [[0, Em], [16, Am7], [38, D7]],
                        [[18, G], [40, Em]],
                        [[17, Am7], [35, D7]],
                        [[18, G]],
                        [[0, Em], [18, Am7], [31, D7]],
                        [[14, G], [30, Em]],
                        [[18, Am7], [31, D7]],
                        [[25, G]],
                        [[0, G7], [18, C], [35, D]],
                        [[19, BmD], [34, GB]],
                        [[16, C], [34, D]],
                        [[18, BmD], [36, Em]],
                        [[17, Am7]],
                        [[19, D6], [41, G]],
                        [[0, GB], [17, Am7]],
                        [[19, D6], [41, G]]
                    ],
                    lyrics:
                    [
                        "When I'm in Beijing you're off to Shanghai",
                        "When I'm in Hong Kong you're doing Macau",
                        "All those crazy nights we spend together",
                        "As voices on the phone",
                        "Wishing we could be more telepathic",
                        "Tired of the nights I sleep alone",
                        "Wishing we could redirect the traffic",
                        "And we find ourselves a home",
                        "Can you feel the raindrops in the desert",
                        "Have you seen the sunrays in the dark",
                        "Do you feel my love when I'm not present",
                        "Standing by your side while miles apart",
                        "Sunshine in the rain",
                        "Love is still the same   Shall we date again",
                        "Sunshine in the rain",
                        "Love is still the same   We shall date again"
                    ]
                },
                postscript: "It seems that D7 is not a good choice, but matches with the melody well. Why?",
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "It is not good to sing ",
                        [TAG.q, "Sunshine in the rain"],
                        " twice in the same paragraph, I'm afraid. So..."
                    ]
                }
            }
        }
    }
};
