var DATA =
{
    gequ:
    {
        language: "zh",
        nav: "歌曲",
        classification:
        {
            dl:
            {
                nav: "大陆",
                header:
                {
                    h1: "大陆歌"
                },
                main:
                {
                    mgmgwan:
                    {
                        h2: "玫瑰玫瑰我爱你（新谱置顶）",
                        preface:
                        [
                            "别看这歌蛮短俄、旋律也简单，花头蛮大娥！", PB,
                            "据说传到美国、被翻唱后，美国人说什么也不相信是中国歌依钢" + EMOJI.surprise, PB,
                            "下面的歌词儿是这样安排的：把原曲开头的两段拆开，分别放在副歌的前后，主歌各唱一段。", LB,
                            "两段高潮第1句中的“心”，起唱点有两种，通过和弦名的位置能看出来吧？" +
                            "择其一即可；混合亦可，即第2遍迟一拍再唱。", LB,
                            "两段第2句的最后一个音不同，要注意。第2遍也可以往高音处唱！", LB,
                            "最后加了结束句，“爱”往高音处唱！", LB,
                            "唱高的两处请参考美国版。", PB,
                            "为了体现出老上海的味道，最好用爵士风格来演奏！"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, Cadd9], [3, CE], [5, Dm7], [7, G]],
                                [[1, Cadd9], [3, F], [5, Am7G], [7, GD]],
                                [[1, Am7E], [3, Am7G], [5, G7D], [7, Em7]],
                                [[1, Cadd9], [3, FM7], [5, G], [7, C]],
                                [[1, CM7], [3, DmA], [6, Esus4B], [8, CG]],
                                [[1, G7D], [4, Cadd9], [6, Am7G], [8, CE]],
                                [[0, CM7], [3, DmA], [5, Esus4B], [8, CG]],
                                [[1, G7D], [4, Cadd9], [6, Am7G], [8, GD]],
                                [[1, Cadd9], [3, CE], [5, Dm7], [7, G]],
                                [[1, Cadd9], [3, F], [5, Am7G], [7, GD]],
                                [[1, Am7E], [3, Am7G], [5, G7D], [7, Em7]],
                                [[1, Cadd9], [3, Am], [5, G], [7, C]],
                                [[1, Cadd9], [3, F], [5, G], [6, E], [7, C]]
                            ],
                            lyrics:
                            [
                                "玫瑰玫瑰最娇美",
                                "玫瑰玫瑰最艳丽",
                                "长夏开在枝头上",
                                "玫瑰玫瑰我爱你",
                                "心的誓约 心的情意",
                                "圣洁的光辉照大地",
                                "心的誓约 心的情意",
                                "圣洁的光辉照大地",
                                "玫瑰玫瑰情意重",
                                "玫瑰玫瑰情意浓",
                                "长夏开在荆棘里",
                                "玫瑰玫瑰我爱你",
                                "玫瑰玫瑰我爱你"
                            ]
                        },
                        postscript:
                        [
                            "……", PB,
                            "Esus4/B的效果好像还不错哦？", PB,
                            "以上是按照流行风来编配的；把没有七音的和弦统统加上7，好像爵士味儿就出来了？", LB,
                            "这样就可能会出现",
                            [TAG.CHORD, CM9],
                            "、",
                            [TAG.CHORD, Bm7b5],
                            "等高级货！能用上大九和半减，那说明水平又上升了！"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep.5 1:22.1 ~ 2:2
                            comment: "第2句中的第2个玫瑰唱得很有味道！"
                        }
                    },
                    dxsh:
                    {
                        h2: "丹心似火",
                        preface:
                        [
                            "选用了a小调，好像很难唱哦？变调夹夹在5品如何？", LB,
                            "也考虑过转成d或e小调，但和弦配得较为花哨，实在是转不起来！"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, Am], [5, EmB]],
                                [[1, CM7], [5, GB], [7, Em]],
                                [[1, Am], [5, EmB]],
                                [[1, FM7], [5, G], [7, Am]],
                                [[3, DmE], [7, G]],
                                [[3, GD], [7, Am]],
                                [[3, CM7], [7, Dm7]],
                                [[3, Em7], [7, Em]],
                                [[3, F], [5, GB], [7, Am]],
                                [[3, AmE], [5, GD], [7, Em]],
                                [[2, FM7], [4, Dm], [5, Em], [7, Em7]],
                                [[3, Asus4], [7, G], [9, Am]],
                                [[3, F], [5, GB], [7, Am]],
                                [[3, AmE], [5, GD], [7, Em]],
                                [[2, Am], [4, Dm], [5, Em], [7, F]],
                                [[3, AmE], [7, Dsus2], [9, Am]],
                                [[1, Dm], [2, Em], [3, Am]]
                            ],
                            lyrics:
                            [
                                "夜凭栏 半月起",
                                "义薄云天仰美酒",
                                "破云烟 驱妖雾",
                                "坦荡胸襟忠魂住",
                                "头可断 命可弃",
                                "丹心热血参天地",
                                "辩是非 断心迷",
                                "横扫魔障奋马蹄",
                                "一声长啸震鬼蜮",
                                "大道青天任我去",
                                "俯瞰人间寻常里",
                                "雷霆怒吼霞光朗天地",
                                "一声长啸震鬼蜮",
                                "大道青天任我去",
                                "俯瞰人间寻常里",
                                "雷霆怒吼霞光朗天地",
                                "朗天地"
                            ]
                        },
                        postscript:
                        [
                            "第2段落蛮难配的！", LB,
                            "Dm/E好像有点儿怪哦？但从Am接过来，换弦蛮方便的。", LB,
                            "第2、3个都打算用与G相关和弦。为了避免重复，就把后一个定为G/D。", LB,
                            "Em7要满按。本来考虑选",
                            [TAG.CHORD, FM7],
                            "，但唱起来容易走音。", PB,
                            "高潮部分配得还行：", LB,
                            "两段第3句第1个和弦本来都选了",
                            [TAG.CHORD, FM7],
                            "，为了突出两段旋律的不同，第2遍改成了Am，因为后面又有个F。", LB,
                            "第4句中挂四和挂二的效果好像还不错哦？满按的Em7换到Asus4老方便的。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "网友们都说《神探狄仁杰4之情花金人案》拍了老憨俄，但主题歌相当赞啊！", LB,
                                "确实，气势磅礴；歌词儿还蛮深奥俄！大有超越前作之势。"
                            ]
                        }
                    },
                    lsadm:
                    {
                        h2: "老鼠愛大米",
                        preface: "G调唱起来稍稍有点儿高？",
                        section:
                        {
                            chords:
                            [
                                [[3, G], [7, D], [11, Em], [15, FWS + C]],
                                [[2, G], [5, C], [8, Am7], [12, D7]],
                                [[3, G], [7, D], [11, Em], [15, Bm]],
                                [[3, C], [7, D], [10, G], [11, G]],
                                [[3, Bm], [7, Em], [11, C], [13, D], [15, G]],
                                [[3, Bm], [7, Em], [12, Am7], [16, D7]],
                                [[3, Bm], [7, Em], [11, C], [13, D], [15, G]],
                                [[3, Bm], [7, Em], [11, Am7], [12, Am7], [15, D7], [16, D7]],
                                [[3, G], [7, FWS + Em], [11, G], [15, Bm]],
                                [[3, C], [7, G], [12, Am], [16, D]],
                                [[3, G], [7, FWS + Em], [11, G], [15, Bm]],
                                [[3, C], [7, G], [13, Am], [14, D], [18, G], [20, G]]
                            ],
                            lyrics:
                            [
                                "我听见你的声音 有种特别的感觉",
                                "让我不断想 不敢再忘记你",
                                "我记得有一个人 永远留在我心中",
                                "哪怕只能够这样的想你",
                                "如果真的有一天 爱情理想会实现",
                                "我会加倍努力好好对你 永远不改变",
                                "不管路有多么远 一定会让它实现",
                                "我会轻轻在你耳边对你说 对你说",
                                "我爱你 爱着你 就像老鼠爱大米",
                                "不管有多少风雨 我都会依然陪着你",
                                "我想你 想着你 不管有多么的苦",
                                "只要能让你开心 我什么都愿意 这样爱你"
                            ]
                        },
                        postscript: "Am和Am7、D和D7有空时再看看……",
                        details:
                        {
                            comment:
                            [
                                "好像改成F调来唱的，但和弦还是用G调的，知道是怎么做到的吗？", PB,
                                "示范弹唱请参考",
                                [TAG.BoALP, "日语版", "uta", "nzmhkmgsk"],
                                "。"
                            ]
                        }
                    },
                    nndxf:
                    {
                        h2: "暖暖的幸福",
                        preface:
                        [
                            "开头第1句改了个字儿，为的是不和第2段重复，句意似乎也更恰当？", PB,
                            "高潮第1句中“喜欢”，字幕打的是“习惯”，不太对吧？", LB,
                            "反复听了好多遍，是“喜欢”呀？从歌词儿常规的套路来看，也应该是…… 而且“习惯”唱起来有点儿拗口？", PB,
                            "另外还有几个别字儿，一并改了。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, Cadd9], [5, FWS + C], [9, Cadd9], [13, G6], [17, C], [18, C]],
                                [[3, Cadd9E], [7, FWS + Am], [12, Cadd9], [16, FWS + G], [17, G]],
                                [[1, C], [5, FWS + CE], [9, Cadd9], [13, G6], [18, FWS + C], [19, C]],
                                [[3, AmE], [6, Am], [10, AmE], [13, G], [14, G]],
                                [[3, C], [6, GB], [12, Am], [14, Am7G]],
                                [[1, F], [5, CE], [8, F], [12, G]],
                                [[1, C], [4, GB], [10, Am], [13, Am7G]],
                                [[1, F], [5, G], [8, C]],
                                [[1, F], [5, G], [8, C]]
                            ],
                            lyrics:
                            [
                                "记得那一天 我们并肩走过红毯的浪漫",
                                "紧紧握着彼此的手 从此再没分开过",
                                "已是好多年 我们慢慢变得越来越像的脸",
                                "一半写着平凡 一半写着简单",
                                "喜欢静静地两个人 依偎在一起",
                                "哼难忘的情歌 聊脸红的秘密",
                                "暖暖地细数着 我们爱的默契",
                                "幸幸福福 走下去",
                                "幸幸福福 走下去"
                            ]
                        },
                        postscript:
                        [
                            "第3行的第1个C要满按，如果用满按的Cadd9就更好了；C/E最好也满按。", LB,
                            "Am/E的效果好像还不错哦？", LB,
                            "高潮部分是根据常规的套路来配的。"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "“聊脸红的秘密”和“幸幸福福”，这两句分男女声部。", PB,
                                "这歌难度蛮大的！从低音5至高音5，音域跨度有两个8度。"
                            ]
                        }
                    },
                    nxhe:
                    {
                        h2: "那些花儿",
                        preface: "女声唱的话，就照着范々姐的版本吧？不过和弦和弹法完全不同，不是单纯变个调儿就行了的！",
                        section:
                        {
                            intro: [[1, G], [3, DFs], [5, Em], [7, C], [9, G], [11, DA], [13, D7], [15, G]],
                            chords:
                            [
                                [[1, G], [5, DFs], [10, C], [15, G]],
                                [[1, G], [5, Em], [10, C], [15, DA]],
                                [[1, G], [5, DFs], [10, Em], [14, C]],
                                [[1, G], [5, DA], [10, D7], [14, G]],
                                [[2, G], [6, DFs]],
                                [[2, Em], [6, C]],
                                [[1, G], [5, DA]],
                                [[2, D7], [6, G]],
                                [[1, G], [6, DFs], [11, Em], [16, Bm7]],
                                [[1, C], [6, G], [11, Em], [15, DA]],
                                [[1, G], [6, DFs], [11, Em], [16, Bm7]],
                                [[1, C], [5, G], [10, DA], [14, G]]
                            ],
                            lyrics:
                            [
                                "那片笑声让我想起 我的那些花儿",
                                "在我生命每个角落 静静为我开着",
                                "我曾以为我会永远 守在她身旁",
                                "今天我们已经离去 在人海茫茫",
                                "她们都老了吧",
                                "她们在哪里呀",
                                "幸运的是我",
                                "曾陪她们开放",
                                "啦啦啦啦 啦啦啦啦 啦啦啦 想她",
                                "啦啦啦啦 啦啦啦啦 她还在开吗",
                                "啦啦啦啦 啦啦啦啦 啦啦啦 去呀",
                                "她们已经被风吹走 散落在天涯"
                            ]
                        },
                        postscript:
                        [
                            "谱子不难背，主要就是前奏那套路子，略有不同而已。", PB,
                            "那时第一次接触",
                            [TAG.CHORD, DFs],
                            "，按得有点儿别扭！经过老师指点后，才发现…… 它还是蛮常用的。", LB,
                            "按Bm7时，食指要用力！"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "当年流行的时候，曾找过谱子。觉得配得还不错，未加修改就搬过来了。"
                        }
                    },
                    nxqlzhk:
                    {
                        h2: "你笑起来真好看",
                        preface: "歌名儿和歌词儿都很好！",
                        section:
                        {
                            intro: [[1, C], [3, C]],
                            chords:
                            [
                                [[1, C], [5, G]],
                                [[1, Cadd9], [5, CE]],
                                [[1, Am], [5, CG]],
                                [[1, Dm7], [5, G]],
                                [[1, C], [5, G]],
                                [[1, AmC], [5, CG]],
                                [[1, F], [5, CG]],
                                [[1, Dm7], [5, C]],
                                [[2, C], [7, Gsus4]],
                                [[2, Am], [7, CG]],
                                [[2, F], [8, CG]],
                                [[1, Dsus2], [5, G]],
                                [[2, C], [7, Gsus4]],
                                [[2, Am7], [6, Am7G]],
                                [[1, F], [5, CG]],
                                [[1, Dsus2], [3, Gsus4], [5, C]]
                            ],
                            lyrics:
                            [
                                "想去远方的山川",
                                "想去海边看海鸥",
                                "不管风雨有多少",
                                "有你就足够",
                                "喜欢看你的嘴角",
                                "喜欢看你的眉梢",
                                "白云挂在那蓝天",
                                "像你的微笑",
                                "你笑起来真好看",
                                "像春天的花一样",
                                "把所有的烦恼 所有的忧愁",
                                "统统都吹散",
                                "你笑起来真好看",
                                "像夏天的阳光",
                                "整个世界全部的时光",
                                "美得像画卷"
                            ]
                        },
                        postscript:
                        [
                            "前奏和高潮第1个C都要满按。", LB,
                            "Gsus4可能画蛇添足了？用G亦可。", LB,
                            "Dsus2似乎也不太好？", LB,
                            "两段高潮的第2句中和弦有变化，为了突出旋律的不同", PB,
                            "看似挺简单的旋律，但配起和弦来还真不容易！现在的结果也不尽如人意……"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment: "团里说要排练，就找来听了下——倒是蛮好听娥！"
                        }
                    },
                    ryrdyfzqg:
                    {
                        h2: "人与人的缘分真奇怪",
                        preface:
                        [
                            "“加油添醋加色彩”里有两个“加”，总觉得用词儿重复……", LB,
                            "考虑过第2个“加”换成“增”，但唱起来有点儿拗口？", LB,
                            "也考虑过全用“加”，好像也不好哦？"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, C], [7, CG]],
                                [[1, C], [7, Dsus2]],
                                [[1, Dsus4], [8, Dsus2]],
                                [[1, Dsus4], [7, CE]],
                                [[1, C], [7, CG]],
                                [[1, C], [7, Dsus2]],
                                [[1, Dsus4], [8, Dsus2]],
                                [[1, D7sus2], [8, FWS + C]],
                                [[3, Cadd9], [7, Am]],
                                [[3, AmC], [7, G]],
                                [[3, Cadd9], [7, Am]],
                                [[2, F], [7, G]],
                                [[3, Cadd9], [7, Am]],
                                [[3, AmC], [7, G]],
                                [[3, Cadd9], [7, Am]],
                                [[2, F], [6, G6], [8, C]]
                            ],
                            lyrics:
                            [
                                "人与人的缘分真奇怪",
                                "就像狂风暴雨说来就来",
                                "爱情的迷雾总看不明白",
                                "喜怒哀乐费疑猜",
                                "情海浮沉难免受伤害",
                                "上天安排不能说爱就爱",
                                "胡思乱想又何必自怨自艾",
                                "缘分说来自然就会来",
                                "人生的路很精彩",
                                "有人相伴也不坏",
                                "日子淡淡如水你不爱",
                                "加油添醋加色彩",
                                "人群茫茫像大海",
                                "只有你是最可爱",
                                "从此心甘情愿随你摇摆",
                                "就一生一世不分开"
                            ]
                        },
                        postscript:
                        [
                            "前两段第3句中的Dsus4，也考虑过C/D，哪个好点儿？", LB,
                            "第4句第1个和弦也可以用Dsus2，换成别的是为了求变，且突出两段旋律的不同。", LB,
                            "第1段最后一个本来选的是Em，但欢快的歌曲用小三结尾太悲伤了？所以……"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment: "前奏第1句和主歌第1句略有不同。"
                        }
                    },
                    zyssg:
                    {
                        h2: "子夜四时歌",
                        preface:
                        [
                            "要用吴语来演唱，否则不好听！", LB,
                            "多听听原唱，模仿她们的发音。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, Dm], [2, Em], [3, Cadd9], [5, Am]],
                                [[1, F], [3, F], [5, Em], [6, Em]],
                                [[1, C], [2, CE], [3, Cadd9], [5, Dm]],
                                [[1, AmC], [3, Dm7], [5, Am], [6, Am]]
                            ],
                            lyrics:
                            [
                                "春林花多媚",
                                "春鸟意多哀",
                                "春风复多情",
                                "吹我罗裳开"
                            ]
                        },
                        postscript: "Am/C的效果好像还不错哦？",
                        details:
                        {
//                            demo: TAG.audio,
                            comment: "电视剧中有个老头子乱叫！使得这歌没有完美版的" + EMOJI.angry
                        }
                    }
                }
            },
            xg:
            {
                nav: "香港",
                header:
                {
                    h1: "香港歌"
                },
                main:
                {
                    adwn:
                    {
                        h2: "爱的温暖（新谱置顶）",
                        preface:
                        [
                            "旋律蛮简单的，就那么几句反复唱。不过蛮有劲儿哦？", LB,
                            "加了结束句，和原曲不同。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, C], [6, Am7]],
                                [[1, Dsus2], [6, Dm7], [9, G]],
                                [[1, C], [6, Am7]],
                                [[2, Dsus2], [7, C]],
                                [[1, C], [6, Am7]],
                                [[1, Dsus2], [6, Dm7], [9, G]],
                                [[1, C], [6, Am7]],
                                [[2, D7sus4], [7, G]],
                                [[3, C], [9, Cadd9]],
                                [[1, D7sus2], [5, FM7], [8, D7sus2], [12, G]],
                                [[3, C], [9, Cadd9]],
                                [[1, D7sus2], [5, F], [7, G]],
                                [[3, C], [9, Cadd9]],
                                [[1, D7sus2], [5, FM7], [8, D7sus2], [12, G]],
                                [[3, C], [9, Cadd9]],
                                [[1, D7sus2], [5, GA], [7, C]],
                                [[1, D7sus2], [5, G7A], [7, C]]
                            ],
                            lyrics:
                            [
                                "在外要 扮演着你",
                                "进了家 不需再力疲",
                                "或外界 误解着你",
                                "家里也必体谅你",
                                "附和你 未需道理",
                                "对你好 可体贴入微",
                                "佑护你 在屋檐里",
                                "倦疲 仍然能报喜",
                                "同住我与你 同度跌与起",
                                "要捉紧快乐 不要天天皱眉",
                                "同路我与你 无论乐与悲",
                                "满天风雨亦撑起",
                                "如像老友记 同度跌与起",
                                "顷刻的压力 总有一天远离",
                                "同路我与你 无论乐与悲",
                                "爱的温暖别忘记",
                                "爱的温暖别忘记"
                            ]
                        },
                        postscript:
                        [
                            "第1句的俩小节也可以各放俩和弦。例如：在C后插个C/G；在Am7后插个C或C/G。", LB,
                            "第3句和第2段同样处理亦可；或者两段分别采用不同的方式，显得有变化。", PB,
                            "第2段第4句中选择D7sus4，一是换弦方便，二是加上七度音好像更有味道？", LB,
                            "换成Dsus4也行；拆成Dsus2和Dsus4也行。", PB,
                            "高潮中的",
                            [TAG.CHORD, FM7],
                            "和F，本来也考虑过都用Am，哪个好点儿？", LB,
                            "或者两段分别采用不同的方式，显得有变化。", PB,
                            "最后两句中的第2个和弦，也试过Am7，哪个好点儿？", LB,
                            "为了求变，结束句中也加上了七度音。"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "据说和《香港料理》雷同……", LB,
                                "是有点儿像！可能是参考了前作，但改得不错啊！"
                            ],
                        }
                    },
                    ahdgs:
                    {
                        h2: "阿花的故事",
                        preface: "每段的第1句蛮好听的，唱起来很有味道，听起来意犹未尽。",
                        section:
                        {
                            chords:
                            [
                                [[1, C], [3, Cadd9], [6, C], [9, G]],
                                [[1, Cadd9E], [4, Am], [8, Dm7], [12, G]],
                                [[1, Dsus4], [3, F], [7, D7sus4], [11, Em]],
                                [[1, F], [3, Dm7C], [7, Am7G], [9, G]]
                            ],
                            lyrics:
                            [
                                "名字叫阿花摇着尾巴",
                                "它只喝牛奶哪日跟我在喝茶",
                                "陪我读书偷懒从来无责骂",
                                "夜晚阿花专爱梁上爬"
                            ]
                        },
                        postscript:
                        [
                            "开头连弹仨C也行，用add9是为了求变。", LB,
                            "第2句用了Cadd9/E！效果好像还不错哦？", LB,
                            "还有两处也用了转位和弦。"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "乍一听，总觉得最后一句应该回到DO来结尾？至少最后一段要返回，前几段可以以低音的SO结束，毕竟后面还有。", LB,
                                "但是这一点作曲者肯定也想到的……", LB,
                                "家母说就是要避免俗套！", LB,
                                "唱多了之后，SO结尾好像是挺顺口的，回到DO反而有点儿怪？你觉得呢？"
                            ]
                        }
                    },
                    cchr:
                    {
                        h2: "叱咤红人",
                        preface:
                        [
                            "G调唱起来稍稍有点儿高？", PB,
                            "选了几句第2段的歌词儿，放至第1段来唱。唱这歌儿无非就是对韦小宝艳福的憧憬……", LB,
                            "原版因为唱两段，最后一句从“我冇胆”到“你够胆”，倒还真不错；唱一遍的话，好像很窝囊哦？所以改词儿了！"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, G], [8, FWS + Em]],
                                [[1, Am], [8, FWS + D]],
                                [[1, C], [7, G]],
                                [[1, Am7], [6, FWS + D7]],
                                [[4, Bm], [8, Em]],
                                [[1, Am7], [5, FWS + D]],
                                [[4, Bm], [8, Em]],
                                [[1, Am7], [6, D7]],
                                [[1, G], [6, Em]],
                                [[2, Am7], [8, FWS + D7]],
                                [[3, G], [8, Em]],
                                [[4, C], [11, D], [17, Em], [18, Em]],
                                [[2, C], [6, D], [8, G]]
                            ],
                            lyrics:
                            [
                                "求其横掂做人最易",
                                "搭够当真自然之至",
                                "小流氓 变叱咤红人",
                                "搞搞震便当真",
                                "时运最高 任佢天冧落嚟",
                                "自会有新计",
                                "情分满泻 让我娶足七个",
                                "未会算多 齐共我唱歌",
                                "智慧 加啲气势",
                                "想要世界调转 亦未係难事",
                                "加啲放肆 加啲创意",
                                "一身充满少壮傲气 想痛快抉择博一次",
                                "我梗係放尽够胆试"
                            ]
                        },
                        postscript: "D或D7都是凭感觉配的，好像还算和谐？等有空时再力求配得更精确些……",
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "朋友们都说唱得蛮好……" + EMOJI.awkward, PB,
                                "好像改成F调来唱的，但和弦还是用G调的，知道是怎么做到的吗？"
                            ]
                        }
                    },
                    ffz:
                    {
                        h2: "放风筝",
                        preface:
                        [
                            "歌名儿是即兴取的。", PB,
                            "网上只找到一个",
                            [TAG.a, "页面", "https://zhidao.baidu.com/question/651740046295640485.html"],
                            "与这歌有关，歌词也是从那儿抄来的。", LB,
                            "缺少的词儿由小映老师补全" + EMOJI.smile
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, C], [4, C]],
                                [[1, Cadd9], [6, G6]],
                                [[1, Dm], [5, F]],
                                [[1, G], [6, C]],
                                [[1, C], [4, C]],
                                [[1, Cadd9], [6, G6]],
                                [[1, Dm], [5, F]],
                                [[1, G], [6, C]],
                                [[1, CE], [5, Dsus2]],
                                [[1, CM7], [6, AmB]],
                                [[1, FM7], [5, CE]],
                                [[1, Dm7], [5, G]],
                                [[1, C], [4, C]],
                                [[1, Cadd9], [6, G]],
                                [[1, Dm], [5, F]],
                                [[1, G], [6, C]]
                            ],
                            lyrics:
                            [
                                "结伴去放风筝儿",
                                "似风筝真正很自由",
                                "用双手怀抱日后",
                                "说笑声齐合奏",
                                "你共我永不忧愁",
                                "似风筝天际快乐游",
                                "用真心齐向上望",
                                "哪怕艰难没有",
                                "飞飞飞 好欢喜",
                                "这世界是个乐园地",
                                "有你和我天天嬉戏",
                                "好玩到飞起",
                                "你共我永不忧愁",
                                "似风筝天际快乐游",
                                "愿彼此承美梦在",
                                "永远心灵活透"
                            ]
                        },
                        postscript:
                        [
                            "开头连弹仨C也行，用add9是为了求变。", LB,
                            "Am/B的效果好像还不错哦？", LB,
                            "最后1段第2句中换掉了G6，是因为改了点儿旋律。哪个好些？"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep.5 11:56.0 ~ 12:54.9 (unrecorded!)
                            comment:
                            [
                                "边拉边唱，这也可以？", PB,
                                "第2段第4句乍一听，以为是“哪怕有男朋友”" + EMOJI.awkward
                            ]
                        }
                    },
                    msyz:
                    {
                        h2: "马上英姿",
                        preface:
                        [
                            "选用了a小调，大概适合女声唱哦？男声的话，建议转成d或e小调。", LB,
                            "但和弦配得较为花哨，实在是很难转！还是用变调夹吧？", LB,
                            "当然一定要转也不是不行，几个冷僻的和弦适当简化一下吧！", PB,
                            "主歌第2段落的起唱点好像慢了两拍？哎，总之原谱肯定是不会错的啦！", LB,
                            "乐理知识还有待加强……", PB,
                            "高潮最后部分有两句：“看是……”和“看似……”，发音雷同。", LB,
                            "琢磨着改几个字儿？"
                        ],
                        section:
                        {
                            intro: [[1, Am], [3, Am]],
                            chords:
                            [
                                [[1, Asus2], [5, AmE]],
                                [[1, Asus2B], [5, Dsus2], [7, Am]],
                                [[2, FWS + Dm7], [6, FWS + G]],
                                [[4, FWS + Am], [5, Asus4]],
                                [[1, Em7], [5, Em]],
                                [[1, Em7], [5, CM7], [7, Am]],
                                [[0, Dm], [5, FWS + Dm7]],
                                [[6, FWS + Em], [7, Em7]],
                                [[1, Am], [5, G], [8, FM7], [12, AmE]],
                                [[1, Am], [5, G], [7, Em], [8, Em7]],
                                [[1, Am], [5, G], [8, FM7], [12, AmE]],
                                [[0, CM7], [5, FWS + Am], [9, G], [11, Am], [12, Asus2]],
                                [[0, CM7], [5, FWS + Am], [9, G], [11, Am]]
                            ],
                            lyrics:
                            [
                                "斜阳下战云密布",
                                "未尝令我退一步",
                                "英姿威风飒爽",
                                "马上流露",
                                "因你给我添信心",
                                "使我改写我命途",
                                "饱经风与霜",
                                "尽管加上一刀",
                                "凭我义胆忠肝 那惧群魔起舞",
                                "豪情自比天更高",
                                "情场亦比战场 看是谁给俘掳",
                                "看似弱女儿 小心给压倒",
                                "看这袭战袍 绣上我名号"
                            ]
                        },
                        postscript:
                        [
                            "Asus2/B的效果好像还不错哦？", LB,
                            "Dsus2和Am同属一小节。", LB,
                            "第4句本来配了俩Am。为了求变，改了后一个。选择Ausu4，是考虑到与下一个和弦的衔接。", PB,
                            "（因为前言中提及的“慢两拍”的错觉，导致从第2段落开始，小节的分隔一度找不准！现在的编配是按照跳过那两拍来处理的，如果有错再改。）", LB,
                            "开头连弹仨Em7也行，用Em是为了求变。", LB,
                            [TAG.CHORD, CM7],
                            "和Am同属一小节。", LB,
                            "后两句都分别用了三、七和弦，也是为了求变。", PB,
                            "高潮中的",
                            [TAG.CHORD, FM7],
                            "换成F也行。", LB,
                            "第4句和结束句中的Am和G同属一小节。", LB,
                            "Ausu2换成Am也行。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "有一处略微唱卡壳了，不明显" + EMOJI.awkward
                        }
                    },
                    ylszd:
                    {
                        h2: "缘来是注定",
                        preface:
                        [
                            "本来选用a小调，女声唱应该是没问题的；d小调好像更适合男声哦？", PB,
                            "有网友说3段唱同样的词儿不好，它自己填了几句，就显得不单调了。", LB,
                            "试唱了一下，还不错的！不过暂时不宜转载……"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, Dm], [6, Am], [8, Dm]],
                                [[1, FM7], [6, CE], [10, Am]],
                                [[1, Dm], [6, C], [8, Dm]],
                                [[1, FM7], [6, CE], [10, Dm]],
                                [[1, FA], [2, Fadd9A], [6, FC]],
                                [[1, Am], [2, Am7], [6, Dm7]],
                                [[2, Gsus2], [6, FM7], [8, Dm]],
                                [[2, AmE], [4, C], [6, Dm]]
                            ],
                            lyrics:
                            [
                                "望远方 芳草已冰",
                                "冰封恩怨 风霜飘满路径",
                                "路冷清 也许听命",
                                "孤单一个 天空只有晚星",
                                "悲 原来是注定",
                                "哀 悔当初用情",
                                "为何往日得意忘形",
                                "结局实难说清"
                            ]
                        },
                        postscript:
                        [
                            "配完后才发现每行仨和弦，很有意思哦！并不是刻意这么做的，真的是巧合。", LB,
                            "有的是前俩同属一小节，有的是后俩。这里就不具体叙述了，应该不难分辨的吧？", PB,
                            "高潮第1和第2句的前一小节旋律相同，为啥用不同风格的和弦呢？", LB,
                            "差别就在于受后一小节的影响，第1句好像是整首悲情调中的一缕阳光，虽然词儿唱的也是“悲”；" +
                            "而第2句则又立马回到了原来的主题上。", LB,
                            "当然这纯属个人的理解！不知道你是什么感觉呢？", PB,
                            "Gsus2最好要满按，但有点儿难度的哦？", LB,
                            "在它之后可以插入一个Am或Am7。但为了…… 就没……"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "男声唱出来效果不好哦？", LB,
                                "田姊々唱得真好啊！"
                            ]
                        }
                    },
                    yyt:
                    {
                        h2: "又一天",
                        preface:
                        [
                            "这歌的旋律有点儿特别。", LB,
                            "最特别之处是：高潮第3句中有个半音！", PB,
                            "前两句都是以“话”结尾，重复了。", LB,
                            "最后一句歌词儿“声音会变”好像没什么意义？", LB,
                            "都想改掉……"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, CM7], [5, C], [7, Asus2], [11, Am]],
                                [[1, CM7], [5, CE], [9, Am], [13, FWS + GB]],
                                [[1, Em], [4, FWS + EmB], [7, CM7], [11, FWS + Dm]],
                                [[1, CM7], [5, G6], [9, Am + FWS + G], [10, FWS + C], [12, Cadd9]],
                                [[4, C], [5, Cadd9], [9, AmE], [11, Dsus2]],
                                [[2, E], [4, Dm7], [6, CE], [9, FWS + Cadd9E]],
                                [[4, C], [5, Cadd9], [9, FE], [13, Dsus2]],
                                [[2, E], [4, Dm], [6, CE], [9, FWS + C]]
                            ],
                            lyrics:
                            [
                                "如你用眼神 在秘密说话",
                                "何以没法缩短距离直接地对话",
                                "能确定爱吧 愿拒绝我吗",
                                "时间没法保管我们那年华",
                                "又过一天 动魄惊心场面",
                                "可给留恋 会在那天",
                                "又过一天 能留下什么于耳边",
                                "可知明天 声音会变"
                            ]
                        },
                        postscript:
                        [
                            "正因为这歌特别，所以一开头就用上了大七和挂二。", LB,
                            "而半音处则选择了不常用的3级大三和弦。", LB,
                            "F/E好像有点儿怪哦？"
                        ],
                        details:
                        {
//                            demo: TAG.video, // Ep.5 11:56.0 ~ 12:54.9
                            comment: "……"
                        }
                    }
                }
            },
            taiwan:
            {
                nav: "台湾",
                header:
                {
                    h1: "台湾歌"
                },
                main:
                {
                    ldxyq:
                    {
                        h2: "绿岛小夜曲（新谱置顶）",
                        preface:
                        [
                            "这是首情歌，女歌手如果也唱“姑娘”，似乎不太恰当哦？", LB,
                            "与之对应的词儿呢，首先想到的肯定是“小伙”，但这样唱好像老憨娥哦？", LB,
                            "听纪老师说：“那个姑娘改为情郎！”嗯，改得完美！甄老师也是这么唱的。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[2, G], [4, GA], [10, G], [15, D]],
                                [[1, Em], [5, GA], [10, Asus4], [15, D]],
                                [[1, CM7], [6, G], [11, Am7], [17, D7]],
                                [[1, G], [6, Am7], [11, D6], [17, G]],
                                [[1, CM7], [8, Am7], [14, D7]],
                                [[1, G], [7, Am7], [12, D]],
                                [[2, EmD], [8, D]],
                                [[1, EmB], [6, GA], [11, CM7], [14, G]]
                            ],
                            lyrics:
                            [
                                "这绿岛像一只船 在月夜里摇呀摇",
                                "姑娘哟 你也在我的心海里飘呀飘",
                                "让我的歌声随那微风 吹开了你的窗帘",
                                "让我的衷情随那流水 不断地向你倾诉",
                                "椰子树的长影 掩不住我的情意",
                                "明媚的月光更照亮了我的心",
                                "这绿岛的夜已经这样沉静",
                                "姑娘哟 你为什么还是默默无语"
                            ]
                        },
                        postscript:
                        [
                            "最纠结的是G/A，斟酌了好久，也考虑过Gadd9，哪个好点儿？", LB,
                            "Em/D的效果相当好啊？", PB,
                            "配完和弦后，发现自己的水平有了很大的提高！", LB,
                            "能够用上挂四、加六和大七，真的很开心！", LB,
                            "难怪这歌的曲风有点儿特别？"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep.14 23:42.5 ~ 25:14.8
                            comment:
                            [
                                "应该是演员本人唱的，杨老师也是有名的歌手！", PB,
                                "唱得好不好，就听第1句。更确切地说，就听第3个字——岛！" +
                                "不是单纯一个“岛”字儿，后面要“哦噢喔”！没有转音或是转不来的，那都属于唱得差的。", LB,
                                "同样地，“摇呀摇”和“飘呀飘”的“呀”，最好也转一下。不过和“岛”相比，就没那么明显、那么重要了。", LB,
                                "有些版本里“那微风”或“吹开了”也…… 看歌手自己发挥了。", PB,
                                "示范弹唱请参考",
                                [TAG.BoALP, "日语版", "uta", "otmgkrnamgfr"],
                                "。"
                            ]
                        }
                    },
                    cf:
                    {
                        h2: "春风",
                        preface:
                        [
                            "因为是完全按照“陈天贵”的表演来记谱的，所以选用了F调。", LB,
                            "如果你觉得有难度，不如改成G调的和弦？当然，前提是你能再唱高一个音！"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[2, F], [4, F], [6, FWS + Am], [8, A7], [10, Gm], [12, Gm], [14, FWS + Dm], [16, Dm]],
                                [[2, F], [4, F], [6, FWS + Am], [8, A7], [10, Gm], [12, C7], [15, F], [16, F]],
                                [[3, bB], [5, bB], [8, F], [9, C7], [12, bB], [14, bB], [17, F], [18, C]],
                                [[3, F], [5, F], [7, FWS + Am], [9, A7], [11, Gm], [13, C7], [16, F]]
                            ],
                            lyrics:
                            [
                                "春风快加紧脚步 快到我窗前漫舞",
                                "春风请穿过门缝 请在我脸上轻吻",
                                "越过那千层的山峰 带给我亲切的问候",
                                "今年我们又再相逢 请给我新的祝福"
                            ],
                            outro: [[1, bB], [2, C], [3, F]]
                        },
                        postscript:
                        [
                            "F和",
                            [TAG.CHORD, bB],
                            "还是用大横按比较好。指力强劲的网友，如果能用双横按来按",
                            [TAG.CHORD, bB],
                            "，那当然最好！", LB,
                            "尾奏中的C最好也大横按，这样换弦方便些。"
                        ],
                        details:
                        {
                            demo: TAG.video, // Ep.19 4:31.2 ~ 5:20.9
                            comment:
                            [
                                "澎老师唱得真好啊，琴弹得更好！", PB,
                                "大拇指扫弦？这个手法没看懂……", LB,
                                "第3句中的C7似乎不是很好？而且换弦也不太方便。不如把前一个F再弹一次？"
                            ]
                        }
                    },
                    ydgz:
                    {
                        h2: "一代公主",
                        preface: "《一代女皇》就不提供了。",
                        section:
                        {
                            chords:
                            [
                                [[0, Am], [3, Em]],
                                [[0, Am], [3, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                                [[0, Am], [3, Em]],
                                [[0, Am], [3, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                                [[1, Dm7], [5, Am], [9, Em], [10, Em]],
                                [[1, Am], [5, Am7], [8, FWS + Dm], [10, Dm]],
                                [[1, Dm7], [5, EmB], [8, GB], [10, GB]],
                                [[1, Dm7], [5, D6], [8, FWS + G], [10, G]],
                                [[0, Am], [5, Em]],
                                [[0, Am], [5, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]]
                            ],
                            lyrics:
                            [
                                "峨眉 耸参天",
                                "丰颊 满光华",
                                "器宇非凡 是慧根",
                                "唐朝女皇 武则天",
                                "皓腕 刚毅扬",
                                "慧智 兰心巧",
                                "玉纤香动 万卷书",
                                "一代公主 封太平",
                                "春晖普照 溢满宫锦",
                                "女袭母风 展露威仪",
                                "寸寸柔肠 盈盈粉泪",
                                "冷暖人间 恩情几许",
                                "盘踞天下 数十年",
                                "郁郁笙歌 愈寂寥",
                                "两面评价 在人间",
                                "唐朝轶事 永流传"
                            ]
                        },
                        postscript: "最开心的是，能配上D6了耶！",
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "男声唱总是很怪哦？", LB,
                                "其实除了金老师，其他人唱出来都有点儿怪的。"
                            ]
                        }
                    }
                }
            },
            xinjiapo:
            {
                nav: "新加坡",
                header:
                {
                    h1: "新加坡歌／新谣"
                },
                main:
                {
                    cxcwcyd:
                    {
                        h2: "财兴财旺财运到（新谱置顶）",
                        preface:
                        [
                            "这歌音域跨度蛮大的！最低的低至低音5；最高的高到高音2。如果前奏也自己来，那得唱到高音3。", PB,
                            "原歌词倒数第2句太消极了，改之。"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[1, C], [9, C]],
                                [[1, Am], [9, Em]],
                                [[1, Dm7], [9, Dm7]],
                                [[1, F], [3, G], [7, C]],
                                [[3, C], [9, Am]],
                                [[3, C], [9, G]],
                                [[2, Fadd9], [7, CE]],
                                [[2, Dm7], [10, G]],
                                [[2, C], [8, Am]],
                                [[3, C], [10, G]],
                                [[2, Fadd9], [7, CE]],
                                [[3, F], [9, G]],
                                [[1, C], [8, Cadd9]],
                                [[1, Am], [9, Em]],
                                [[1, Dm7], [8, Em], [12, Am]],
                                [[1, Dm7], [7, G]],
                                [[1, C], [8, Cadd9]],
                                [[1, Am], [9, Em]],
                                [[1, Dm7], [8, Em], [12, Am]],
                                [[1, F], [5, G], [7, C]],
                                [[1, F], [3, G], [7, C]]
                            ],
                            lyrics:
                            [
                                "财兴财旺财运到 添福添贵添元宝",
                                "啦啦啦啦啦啦啦啦啦",
                                "财兴财旺财运到 添福添贵添元宝",
                                "啦啦啦啦啦啦啦",
                                "反正无事就下凡来陪你走一遭",
                                "人间缭乱着喧腾热闹",
                                "金银财宝轻轻随手一掏",
                                "我有求必应只怕你嫌少",
                                "安平乐道你仍为一袋米折腰",
                                "利字当前他两肋不插刀",
                                "身缠万贯能否换得一笑",
                                "问苍天 天也不知晓",
                                "钱海大浪涛涛 人心左右摇",
                                "摇向柳暗花明艳阳照",
                                "坐看白云飘飘 快乐自己找",
                                "好山好水好围绕",
                                "钱海大浪涛涛 人心来回闹",
                                "闹出两行眼泪犯不着",
                                "坐看白云飘飘 今生不无聊",
                                "财兴财旺财运到",
                                "啦啦啦啦啦啦啦"
                            ]
                        },
                        postscript:
                        [
                            "尝试着用了Fadd9！也考虑过",
                            [TAG.CHORD, FM7],
                            "，哪个好点儿？或者说别花哨了，直接F得了。", LB,
                            "高潮中的第2个和弦，也考虑过G、G/B、C/G…… 但好像还是Cadd9的效果最好？另外，换弦也方便。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "旋律轻快活泼，歌词朗朗上口！第一次看《财星高照》时就欢喜这歌儿了。", LB,
                                "原唱黄老师前几年……" + EMOJI.cry, PB,
                                "以前觉得黄老师唱得一般，不过也可以理解，毕竟他不是专业歌手。", LB,
                                "现在自己尝试后才发现其实蛮难唱的！"
                            ]
                        }
                    },
                    djdg:
                    {
                        h2: "对酒当歌",
                        preface: "C调唱起来有点儿低？若改弹D调的和弦呢，好像又有点儿怪？建议用变调夹。",
                        section:
                        {
                            chords:
                            [
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, Am]],
                                [[1, G], [7, C]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, Am]],
                                [[1, G], [7, C], [8, C7]],
                                [[1, Dm7], [6, Em]],
                                [[1, F], [6, FWS + C]],
                                [[1, Dm7], [6, Em]],
                                [[1, F], [7, G]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, F]],
                                [[1, G], [7, C]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, F]],
                                [[1, G], [7, C]]
                            ],
                            lyrics:
                            [
                                "路遥遥行遍万里山河",
                                "会知心能有几个",
                                "刀剑里笑看风云变色",
                                "谁胜谁负谁晓得",
                                "浪滔滔数尽悲欢离合",
                                "放得下能有几个",
                                "邀清风明月对酒当歌",
                                "醉三分悠然自得",
                                "不管今夕身处于何方",
                                "酒入肠豪情万丈",
                                "尽管世俗仍笑我痴狂",
                                "恩或怨都由我扛",
                                "天苍苍豪情气壮山河",
                                "得与失又算什么",
                                "刀剑里笑看风云变色",
                                "我行我素我自乐",
                                "人匆匆犹如红尘过客",
                                "名和利又算什么",
                                "邀清风明月对酒当歌",
                                "醉一回人生几何"
                            ]
                        },
                        postscript: "Dm和Dm7差不多，主要是想有点儿变化。嫌麻烦的话，选择其一即可。",
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "手头没有变调夹，只好弹D调了，改了几个和弦。", PB,
                                "想唱出那种洒脱的感觉，结果显得很杂耍" + EMOJI.awkward, LB,
                                "等心情好时再重录一次。"
                            ]
                        }
                    },
                    hqxjh:
                    {
                        h2: "豪情笑江湖",
                        preface: "主歌选用a小调；副歌选用C大调。",
                        section:
                        {
                            chords:
                            [
                                [[1, Am], [6, Dm]],
                                [[1, Cadd9], [5, Am]],
                                [[1, Am], [6, Em]],
                                [[1, DmF], [7, Em]],
                                [[1, Am], [7, sFm]],
                                [[1, F], [6, Am], [7, Em]],
                                [[1, Am], [7, GB]],
                                [[1, F], [7, G]],
                                [[3, C], [9, GB]],
                                [[3, Am], [9, Em]],
                                [[1, F], [7, EmB]],
                                [[1, Dm7], [7, G]],
                                [[3, C], [9, GB]],
                                [[3, Am], [9, Em]],
                                [[1, FM7], [7, EmB]],
                                [[1, Dm7], [5, G], [7, C]]
                            ],
                            lyrics:
                            [
                                "滚滚巨浪 红尘纷乱",
                                "淘尽英雄汉",
                                "笑里藏刀 人心难料",
                                "无奈世态皆炎凉",
                                "知音难寻访 痴心愁断肠",
                                "多情总被无情伤",
                                "风云多变幻 缘聚又缘散",
                                "浮生若梦一场欢",
                                "人生漫漫漫漫路遥长",
                                "看透繁华落尽见真章",
                                "豪情肝胆照 千杯醉难倒",
                                "伴我逐浪迎风笑",
                                "人生漫漫漫漫路遥长",
                                "看透繁华落尽见真章",
                                "豪情肝胆照 千杯醉难倒",
                                "伴我逐浪迎风笑"
                            ]
                        },
                        postscript:
                        [
                            "Cadd9的效果好像还不错哦？最初拆成C和Dm7来演奏过，也是一种选择吧？", LB,
                            "把Dm/F有点儿难按，换成Dm7或F也行、拆成",
                            [TAG.CHORD, FM7],
                            "和Dm也行。", LB,
                            [TAG.CHORD, sFm],
                            "还有待推敲！其它候选的有",
                            [TAG.CHORD, DFs],
                            "、",
                            [TAG.CHORD, D7Fs],
                            "……", LB,
                            "第6句中的Am和Em，用一个Am代替也行。不过此处用5级和弦来结束似乎更合理？但若合成一个Em/A又有点儿怪哦？所以就拆开吧！", LB,
                            "高潮前最后的G用大横按比较好。", LB,
                            "高潮第2遍里用了",
                            [TAG.CHORD, FM7],
                            "，是为了和第1遍有所区别。其实用F也行。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "唱错一个字儿，妈的！", LB,
                                "第2次高潮的第1句，怎么唱得跟走音似的？", LB,
                                "算了，以后再说了。"
                            ]
                        }
                    },
                    mtdfx:
                    {
                        h2: "明天的方向",
                        preface: "因为赶时间，就凭经验、凭感觉配了，好像还算和谐？",
                        section:
                        {
                            chords:
                            [
                                [[0, C], [4, GB], [9, Am], [12, FWS + Em]],
                                [[1, F], [7, CE], [11, Dm7], [12, FWS + G]],
                                [[0, C], [4, GB], [8, Am], [12, FWS + Em]],
                                [[1, F], [4, CE], [8, Dm7], [11, FWS + G]],
                                [[0, C], [4, GB], [8, Am], [12, FWS + Em]],
                                [[1, F], [7, CE], [10, Dm7], [11, FWS + G]],
                                [[0, C], [4, GB], [8, Am], [12, FWS + Em]],
                                [[1, F], [5, CE], [9, Dm7], [11, G], [13, FWS + C]],
                                [[0, C7], [4, F], [8, G], [12, FWS + C]],
                                [[0, C7], [4, FWS + F], [8, FWS + F], [10, G], [12, FWS + C]],
                                [[0, C7], [4, F], [8, G], [12, FWS + Em]],
                                [[0, Am], [3, D7], [7, F], [9, G], [13, C]],
                                [[0, C], [3, D7], [7, F], [9, G], [13, C]]
                            ],
                            lyrics:
                            [
                                "你我他肩并肩走在人生路上",
                                "去实现千百个幻梦中的理想",
                                "旅途中乐意接受无数的挑战",
                                "年轻的心灵才能逐渐成长",
                                "偶尔要面对失意挫折又何妨",
                                "让彼此一同把感受来分担",
                                "生活里不可缺少冲击的力量",
                                "有充实的生命才会活得不平凡",
                                "青春的骄傲写在朝气的脸庞",
                                "年少的喜悦常在眼波中流转",
                                "真挚的情感就是灿烂的阳光",
                                "留在心上照亮我们明天的方向",
                                "留在心上照亮我们明天的方向"
                            ]
                        },
                        postscript:
                        [
                            "以前看别人配的和弦中，C/E出现的频率还蛮高的。当时挺纳闷：直接用C不就得了，转了E好像有点儿怪爱？现在似乎明白了，自己也尝试着用了。", LB,
                            "最满意的是C7！", LB,
                            "高潮第2句也别花哨了，用和前1句一样的和弦，好像也是个不错的选择？"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment: "方便起见，最后两句唱成一样的调儿，与原曲不同。"
                        }
                    }
                }
            },
            mlxy:
            {
                nav: "马来西亚",
                header:
                {
                    h1: "马来西亚歌"
                },
                main:
                {
                    dzgd:
                    {
                        h2: "对质孤单",
                        preface:
                        [
                            "如果从中音1起唱，那最低的是低音3，好像没那么低哦？但从高音1开始的话，最高的就是高音7。", LB,
                            "敏江老师纳闷了：副歌部分都是高音吗？有那么高吗？", LB,
                            "大概是这样：高音谱号后加个升号，SO当DO？（还是说加降号？）", LB,
                            "所以这歌音域跨度蛮大的！从低音6至高音3。而且原版中第3遍高潮还得再升调，那就更高了！", PB,
                            "以下是按G调来编配的；女声唱的话，转成C大概适合哦？", PB,
                            "词儿写得不错，韵也押得好，韵脚几乎没有相同的字儿。", LB,
                            "第2段落第3句有点儿拗口；和下一句里都有“还”，重复了……"
                        ],
                        section:
                        {
                            chords:
                            [
                                [[0, G], [6, BmFs]],
                                [[3, Em7], [8, FWS + D]],
                                [[0, G], [6, DFs]],
                                [[2, FWS + CM7], [7, FWS + D]],
                                [[2, Em]],
                                [[2, Gadd9D]],
                                [[2, Esus4]],
                                [[3, D], [8, D7]],
                                [[4, G], [7, A7sus2], [11, GD]],
                                [[1, A7sus2], [5, Cadd9], [9, Dsus4], [13, Em], [16, FWS + Dsus4]],
                                [[4, G], [7, A7sus2], [11, D], [13, Em7]],
                                [[3, C], [5, BmD], [7, E7sus4], [10, FWS + Dsus4], [13, G]]
                            ],
                            lyrics:
                            [
                                "其实我 没那么勇敢",
                                "只习惯用微笑武装",
                                "到底要 再受多少伤",
                                "考验 我的坚强",
                                "徘徊是非两端",
                                "爱恨中找答案",
                                "就算还是少了陪伴",
                                "至少我还有孤单",
                                "放下了遗憾 成就下个美满",
                                "不怕孤单 再困难我也有勇气去承担",
                                "放下了不安 我要继续往前闯",
                                "失去过才能打开人生另一扇窗"
                            ]
                        },
                        postscript:
                        [
                            [TAG.CHORD, BmFs],
                            "其实就是Bm。", LB,
                            "而",
                            [TAG.CHORD, DFs],
                            "并不是D，不过可用D代替。", LB,
                            [TAG.CHORD, CM7],
                            "可以换成C。", PB,
                            "第2段落有点儿意思，一行只有一个和弦，也是第一次遇到这种情况。" + EMOJI.surprise, LB,
                            "按照节奏来说，感觉应该是每行两个，但……", PB,
                            "高潮第1句中的第3个和弦换成G也行，选择G/D是为了求变。", LB,
                            "E7sus4的效果好像还不错哦？改为Esus4亦可。"
                        ],
                        details:
                        {
                            demo: TAG.audio,
                            comment:
                            [
                                "G调好像有点儿高哦？F大概正好？", PB,
                                "歌中有几处小转音要注意。", LB,
                                "“……武装”和“至少……”两处，好像很容易唱错调的？", LB,
                                "多听原唱、多练习！", PB,
                                "“……我还有孤单”，好像太悲观了？给人感觉“孤单”是啥好东西，在关键时刻当底牌来用？", LB,
                                "要改词儿的话，自然会想到“（至少我）不怕（孤单）”吧？就可以避免与上一句里都有“还”。", LB,
                                "为啥这么“自然”呢？因为高潮中就有这么句话！所以后面的也要改…… 哎？点个题如何？"
                            ]
                        }
                    }
                }
            }
        }
    },
    uta:
    {
        language: "ja",
        nav: "うた",
        header:
        {
            h1: "日本語の歌"
        },
        main:
        {
            sbtnnhn:
            {
                h2: "サボテンの花（新着）",
                preface: "イントロはホンマええやろね！",
                section:
                {
                    intro: [[1, G], [3, CG], [5, G], [7, CG], [9, G], [11, CG], [13, G], [15, CG]],
                    chords:
                    [
                        [[3, G], [5, CG], [9, FWS + G], [11, CG + FWS + G]],
                        [[2, Bm], [3, FWS + Em], [6, Am7], [7, D7]],
                        [[2, G], [5, CG], [9, G], [11, Bm]],
                        [[2, FWS + CD], [5, C], [6, FWS + G], [8, G]],
                        [[3, G], [7, FWS + CG], [9, TFWS + G], [11, CG + FWS + G]],
                        [[2, Bm], [5, Em], [8, FWS + Am7], [9, D7]],
                        [[4, G], [7, CG], [11, G], [13, Bm]],
                        [[2, CD], [5, C], [8, FWS + G], [10, G]],
                        [[3, C], [9, DC], [13, Bm], [16, Em]],
                        [[0, Am7], [5, D7], [9, G], [10, G7]],
                        [[2, C], [6, DC], [10, Bm], [13, Em]],
                        [[0, Am7], [5, D7], [8, G]],
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞",
                        "なななななななななな",
                        "ししししししし",
                        "歌歌歌歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞",
                        "なななななななななななな",
                        "ししししししししし",
                        "歌歌歌歌歌歌歌歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞",
                        "ななななななな ななななななな",
                        "しししししししし"
                    ]
                },
                postscript:
                [
                    "C/Dもあるし、D/Cもある" + EMOJI.surprise, LB,
                    "D/Cは押しにくいか？かわりに、Dを使ってもええ。"
                ],
                details:
                {
                    demo: TAG.audio,
                    comment: "難しいか？"
                }
            },
            otmgkrnamgfr:
            {
                h2: "乙女心に雨が降る",
                preface:
                [
                    "まるで演歌のようよ" + EMOJI.surprise, PB,
                    "女性が歌えば、キーCで大丈夫なはずだ。"
                ],
                section:
                {
                    chords:
                    [
                        [[2, G + FWS], [4, GA + FWS], [7, FWS + G], [11, FWS + D]],
                        [[1, Em + FWS], [4, GA], [8, TFWS + Asus4], [12, FWS + D]],
                        [[1, CM7], [7, G], [11, Am7], [15, D7]],
                        [[1, G], [6, Am7], [11, D6 + FWS], [14, G]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌 歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞詞",
                        "ななななななななな ななななな",
                        "しししし しししし しししし"
                    ]
                },
                postscript: "コードを付けてみてから、編曲が上達したような気がする" + EMOJI.shy,
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "オリジナルは",
                        [TAG.BoALP, "ここ", "gequ/taiwan", "ldxyq"],
                        "をクリックして！"
                    ]
                }
            },
            nzmhkmgsk:
            {
                h2: "ねずみは米がすき",
                preface:
                [
                    "日本の曲みたいわ！", PB,
                    "キーGで歌うなんて難しいかな？"
                ],
                section:
                {
                    chords:
                    [
                        [[3, G], [7, D], [11, Em], [15, FWS + C]],
                        [[3, G], [6, C], [9, Am7], [13, D7]],
                        [[2, G], [6, D], [10, Em], [14, Bm]],
                        [[1, FWS + C], [6, D], [8, G], [9, G]],
                        [[3, Bm], [6, Em], [9, C], [10, TFWS + D], [12, G]],
                        [[2, Bm], [5, Em], [9, Am7 + FWS], [12, D7]],
                        [[3, Bm], [7, Em], [10, C], [11, TFWS + D], [13, G]],
                        [[3, Bm], [6, FWS + Em], [10, Am7], [11, Am7], [15, D7], [16, D7]],
                        [[5, G], [10, FWS + Em], [14, G], [18, Bm]],
                        [[3, C], [6, G], [10, Am], [14, D]],
                        [[6, G], [11, FWS + Em], [15, G], [19, Bm]],
                        [[3, C], [7, G], [12, Am], [14, D], [18, G], [21, G]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞詞",
                        "なななななな ななななななな",
                        "しししししししし",
                        "歌歌歌歌歌歌 歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞詞",
                        "ななななななな ななななな",
                        "しししししししししし しししし",
                        "歌歌歌歌歌歌 歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞詞詞",
                        "ななななななな ななな ななななななな",
                        "ししししししし しししししし ししししし"
                    ]
                },
                postscript: "Am、Am7、DとD7は再検討……",
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "キーFで歌ったけど、上記どおりキーGのコードで弾いた……", LB,
                        "（手元にカポがない）", PB,
                        "オリジナルは",
                        [TAG.BoALP, "ここ", "gequ/dl", "lsadm"],
                        "をクリックして！"
                    ]
                }
            },
            hmbnut:
            {
                h2: "浜辺の歌",
                preface: "女性が歌えば、キーCで大丈夫なはずだ。",
                section:
                {
                    chords:
                    [
                        [[2, G], [4, G + FWS], [5, Am], [6, Em], [9, G], [10, G], [12, D], [13, D7]],
                        [[1, G], [2, G], [4, Am], [5, Em], [8, G], [9, D], [11, G], [12, G]],
                        [[1, FWS + D], [3, Daug + FWS + G], [4, G], [6, FWS + C], [8, Am7], [10, D], [11, D7]],
                        [[2, G], [4, G + FWS + Am], [5, Em], [7, FWS + G], [9, D + FWS], [10, G], [11, G]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌 歌歌歌歌歌",
                        "詞詞詞詞詞 詞詞詞詞詞",
                        "なななな ななななな",
                        "ししししし しししし"
                    ]
                },
                postscript: "増三和音は本曲で最も核心的である！",
                details:
                {
                    demo: TAG.video, // Ep.8 19:51 ~ 20:36
                    comment:
                    [
                        "augコードが使われなかったらしい……", PB,
                        "陳先生は本当にピアノが弾けるようだ……"
                    ]
                }
            },
            hdmrnut:
            {
                h2: "ひだまりの詩",
                preface: "曲名が読めるの？",
                section:
                {
                    chords:
                    [
                        [[2, C], [4, E7B], [7, Am]],
                        [[1, EmG], [5, F], [7, G7], [11, C], [14, C]],
                        [[2, C], [4, E7B], [6, Am]],
                        [[2, EmG], [6, F], [9, G7], [12, C], [13, C]],
                        [[1, FWS + C], [3, E7B], [6, Am]],
                        [[2, Am7G], [6, F], [8, FWS + G7], [12, C], [13, C]],
                        [[1, FWS + C], [3, E7B + FWS], [6, Am]],
                        [[1, FWS + Am7G], [3, D7Fs], [6, Gsus4], [8, G7], [10, G7]],
                        [[1, C], [3, Dm7], [5, Em7B + FWS], [8, E7Gs], [10, FWS + Am], [13, EmG], [15, FWS + F], [18, FmM7]],
                        [[1, C], [3, Am], [5, FWS + Dm7], [9, Gsus4]],
                        [[1, Em7B], [3, Am], [5, FWS + Dm7], [9, Gsus4]],
                        [[1, Em7B], [3, Am], [5, Dm7], [9, Gsus4], [11, C]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌",
                        "詞詞詞詞詞 詞詞詞詞詞詞詞",
                        "なななななな",
                        "しししししし ししししし",
                        "歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞",
                        "なななななな",
                        "ししし しししししし",
                        "歌歌歌歌歌歌歌歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞 詞詞詞詞詞詞",
                        "ななな なななななな",
                        "ししし ししししししし"
                    ]
                },
                postscript:
                [
                    [TAG.CHORD, E7Gs],
                    "は完璧だがね！", LB,
                    "最後のFは、標準的に押したほうがええ。他には代理コードでやってもええ。"
                ],
                details:
                {
                    demo: TAG.audio,
                    comment: "ガッキーに「よく知っとる」と言いたかったが、逆にそう言われた……"
                }
            }
        }
    },
    song:
    {
        language: "en",
        nav: "Song",
        classification:
        {
            us:
            {
                nav: "US",
                header:
                {
                    h1: "American Songs"
                },
                main:
                {
                    sh:
                    {
                        h2: "Rose, Rose, I love You (unfinished!)",
                        preface: "It is said that Americans do not believe that this is a Chinese song.",
                        section:
                        {
                            chords:
                            [
                                [[1, Cadd9], [13, CE], [24, Dm7], [37, G]],
                                [[1, Cadd9], [14, F], [23, Am7G], [38, GD]],
                                [[2, Am7E], [17, Am7G], [30, G7D], [44, Em7]],
                                [[1, Cadd9], [13, FM7], [22, G], [29, C]],
                                [[1, Cadd9], [13, CE], [22, Dm7], [37, G]],/////
                                [[1, Cadd9], [14, F], [23, Am7G], [38, GD]],
                                [[2, Am7E], [17, Am7G], [30, G7D], [44, Em7]],
                                [[1, Cadd9], [13, FM7], [22, G], [29, C]],
                                [[1, CM7], [8, DmA], [16, Esus4B], [28, CG]],
                                [[1, G7D], [8, Cadd9], [16, Am7G], [28, CE]],
                                [[0, CM7], [8, DmA], [15, Esus4B], [28, CG]],
                                [[1, G7D], [8, Cadd9], [16, Am7G], [28, GD]],
                                [[1, Cadd9], [13, CE], [24, Dm7], [37, G]],
                                [[1, Cadd9], [14, F], [23, Am7G], [38, GD]],
                                [[2, Am7E], [17, Am7G], [30, G7D], [44, Em7]],
                                [[1, Cadd9], [13, Am], [22, G], [29, C]],
                                [[1, Cadd9], [13, CE], [24, Dm7], [37, G]],
                                [[1, Cadd9], [14, F], [23, Am7G], [38, GD]],
                                [[2, Am7E], [17, Am7G], [30, G7D], [44, Em7]],
                                [[1, Cadd9], [13, Am], [22, G], [29, C]],
                                [[1, Cadd9], [8, F], [15, G], [22, E], [30, C]]
                            ],
                            lyrics:
                            [
                                "Rose Rose I love you with an aching heart",
                                "What is your future   now we have to part",
                                "Standing on the jetty as the steamer moves away",
                                "Flower of Malaya   I cannot stay",
                                "Make way oh make way for my Eastern Rose",
                                "Men crowd in dozens everywhere she goes",
                                "In her rickshaw on the street or in a cabaret",
                                "Please make way for Rose   you can hear them say",
                                "All my life I shall remember",
                                "Oriental music and you in my arms",
                                "Perfumed flowers in your tresses",
                                "Lotus-scented breezes and swaying palms",
                                "Rose Rose I love you with your almond eyes",
                                "Fragrant and slender 'neath tropical skies",
                                "I must cross the seas again and never see you more",
                                "Way back to my home on a distant shore",
                                "Rose Rose I leave you my ship is in the bay",
                                "Kiss me farewell now   there's nothin' to say",
                                "East is East and West is West   our worlds are far apart",
                                "I must leave you now but I leave my heart",
                                "Rose Rose I love you   I cannot stay"
                            ]
                        },
                        postscript:
                        [
                            "..."
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "..."
                            ]
                        }
                    }
                }
            },
            uk:
            {
                nav: "UK",
                header:
                {
                    h1: "British Songs"
                },
                main:
                {
                    sh:
                    {
                        h2: "Summer Holiday (unfinished!)",
                        preface: "I was not interested in it though I had heard it before. But this time...",
                        section:
                        {
                            chords:
                            [
                                [[1, G], [11, CM7], [21, Am7], [29, D]],
                                [[0, G], [9, CM7], [22, Am7], [31, D]],
                                [[1, G], [9, CM7], [24, Am7], [32, D]],
                                [[1, Am7], [9, D], [21, G], [27, Bm], [29, bBm], [32, Am7], [39, D], [47, G]],
                                [[7, Am7], [23, D], [34, G]],
                                [[7, Am7], [23, D], [30, G]],
                                [[1, Bm], [11, CM7], [21, Am7], [29, D]],
                                [[0, G], [9, CM7], [22, D]],
                                [[1, G], [6, CM7], [16, Am7], [24, D]],
                                [[0, G], [7, CM7], [25, Am7], [33, D]],
                                [[4, G], [10, CM7], [20, Am7], [28, D]],
                                [[4, Am7], [9, D], [21, G], [27, Bm], [29, bBm], [32, Am7], [36, D], [43, G]]/////
                            ],
                            lyrics:
                            [
                                "We're all going on a summer holiday",
                                "No more working for a week or two",
                                "Fun and laughter on our summer holiday",
                                "No more worries for me or you   For a week or two",
                                "We're going where the sun shines brightly",
                                "We're going where the sea is blue",
                                "We've all seen it on the movies",
                                "Now let's see if it's true",
                                "Everybody has a summer holiday",
                                "Doin' things they always wanted to",
                                "So we're going on a summer holiday",
                                "To make our dreams come true   For me and you"
                            ]
                        },
                        postscript:
                        [
                            [TAG.CHORD, bBm],
                            " is perfect, isn't it?"
                        ],
                        details:
                        {
//                            demo: TAG.audio,
                            comment:
                            [
                                "In Episode 8 of ",
                                [TAG.q, "Armed Reaction II"],
                                " I heard this song, sung by YAO."
                            ]
                        }
                    }
                }
            }
        }
    },
    phelng:
    {
        language: "th",
        nav: "เพลง",
        header:
        {
            h1: "เพลงไทย"
        },
        main:
        {
            kg:
            {
                h2: "คู่กัด",
                preface:
                [
                    "I had not expected that it is a Thai song. " +
                    "I found the original 25 years later" + EMOJI.surprise
                ],
                section:
                {
                    intro: [[1, F], [3, Dm], [5, Gm], [7, C7], [9, F], [11, Dm], [13, Gm], [15, C7]],
                    chords:
                    [
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, Gm], [9, C7]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, Gm], [6, C7], [9, F]],
                        [[4, bB], [11, bB]],
                        [[3, F], [10, F]],
                        [[3, bB], [10, bB]],
                        [[2, C], [8, C7]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, F], [9, Dm]],
                        [[3, Gm], [6, C7], [9, F]],
                        [[3, Gm], [6, C7], [9, F]]
                    ],
                    lyrics:
                    [
                        "她总是只留下电话号码",
                        "从不肯让我送她回家",
                        "听说你也曾经爱上过她",
                        "曾经也同样无法自拔",
                        "你说你学不会假装潇洒",
                        "却叫我别太早放弃她",
                        "把过去传说成一段神话",
                        "然后笑彼此一样的傻",
                        "我们这么在乎她 却被他全部抹煞",
                        "越疼她越伤心 永远得不到回答",
                        "到底她怎么想 应该继续猜测吗",
                        "还是说好全抛了吧",
                        "找一个承认失恋的方法",
                        "让心情好好的放个假",
                        "当你我不小心又想起她",
                        "就在记忆里画一个叉",
                        "就在记忆里画一个叉"
                    ]
                },
                postscript:
                [
                    "At my home, there is a song book containing ",
                    [TAG.q, "Rival"],
                    ". It is easy to remember all of the chords.", PB,
                    "Change to C Key if F is difficult for you."
                ],
                details:
                {
//                    demo: TAG.audio,
                    comment:
                    [
                        "While I was watching Taiwanese TV series, Suddenly I found that the composer's name was ",
                        [TAG.q, "Cha Tri Kongsuwan"],
                        "!"
                    ]
                }
            }
        }
    },/*
    lied:
    {
        language: "de",
        nav: "Lied",
        classification:
        {}
    },
    chanson:
    {
        language: "fr",
        nav: "Chanson",
        classification:
        {}
    },*/
    cancao:
    {
        language: "pt",
        nav: "Canção",
        header:
        {
            h1: "Canções Brasileiras"
        },
        main:
        {
            sitr:
            {
                h2: "Ai Se Eu Te Pego (unfinished!)",
                preface:
                [
                    "(The sentences in this area need translating!)", LB,
                    "（ここの文を訳してもらえない？）"
                ],
                section:
                {
                    chords:
                    [
                        [[0, B], [6, sF]],
                        [[1, sGm], [12, E]],
                        [[2, B], [11, sF]],
                        [[1, sGm], [14, E]],
                        [[0, Em], [6, Am7]],///
                        [[1, G], [12, Em]],
                        [[2, Am7], [11, D7]],
                        [[1, G], [14, D7]],
                        [[0, Em], [6, Am7]],
                        [[1, G], [12, Em]],
                        [[2, Am7], [11, D7]],
                        [[1, G], [14, D7]]
                    ],
                    lyrics:
                    [
                        "Nossa, nossa",
                        "Assim você me mata",
                        "Ai, se eu te pego",
                        "Ai, ai se eu te pego",
                        "Delícia, delícia",
                        "Assim você me mata",
                        "Ai, se eu te pego",
                        "Ai, ai, se eu te pego",
                        "Sábado na balada",
                        "A galera começou a dançar",
                        "E passou a menina mais linda",
                        "Tomei coragem e comecei a falar"
                    ]
                },
                postscript:
                [
                    "(The sentences in this area need translating!)", LB,
                    "（ここの文を訳してもらえない？）"
                ],
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "(The sentences in this area need translating!)", LB,
                        "（ここの文を訳してもらえない？）"
                    ]
                }
            }
        }
    },
    lat:
    {
        language: "sv",
        nav: "Låt",
        header:
        {
            h1: "Svenska Sånger"
        },
        main:
        {
            sitr:
            {
                h2: "Sunshine in the Rain",
                preface:
                [
                    "I had not expected that it is a Swedish song, the original of a Chinese cover version named ",
                    [TAG.q, "Sun Will Never Set"],
                    ".", PB,
                    "I have changed 4 cities."
                ],
                section:
                {
                    intro: [[1, G], [3, Am], [5, D7], [7, G]],
                    chords:
                    [
                        [[0, Em], [16, Am7], [38, D7]],
                        [[18, G], [40, Em]],
                        [[17, Am7], [35, D7]],
                        [[18, G]],
                        [[0, Em], [18, Am7], [31, D7]],
                        [[14, G], [30, Em]],
                        [[18, Am7], [31, D7]],
                        [[25, G]],
                        [[0, G7], [18, C], [35, D]],
                        [[19, BmD], [34, GB]],
                        [[16, C], [34, D]],
                        [[18, BmD], [36, Em]],
                        [[17, Am7]],
                        [[19, D6], [41, G]],
                        [[0, GB], [17, Am7]],
                        [[19, D6], [41, G]]
                    ],
                    lyrics:
                    [
                        "When I'm in Beijing you're off to Shanghai",
                        "When I'm in Hong Kong you're doing Macau",
                        "All those crazy nights we spend together",
                        "As voices on the phone",
                        "Wishing we could be more telepathic",
                        "Tired of the nights I sleep alone",
                        "Wishing we could redirect the traffic",
                        "And we find ourselves a home",
                        "Can you feel the raindrops in the desert",
                        "Have you seen the sunrays in the dark",
                        "Do you feel my love when I'm not present",
                        "Standing by your side while miles apart",
                        "Sunshine in the rain",
                        "Love is still the same   Shall we date again",
                        "Sunshine in the rain",
                        "Love is still the same   We shall date again"
                    ]
                },
                postscript: "It seems that D7 is not a good choice, but matches with the melody well. Why?",
                details:
                {
                    demo: TAG.audio,
                    comment:
                    [
                        "It is not good to sing ",
                        [TAG.q, "Sunshine in the rain"],
                        " twice in the same paragraph, I'm afraid. So..."
                    ]
                }
            }
        }
    }
};
