var DATA =
{
    gequ:
    {
        nav: "歌曲",
        classification:
        {
            taiwan:
            {
                nav: "台湾",
                header:
                {
                    h1: "台湾歌"
                },
                main:
                {
                    cf:
                    {
                        h2: "春风",
                        preface:
                            "因为是完全按照“陈天贵”的表演来记谱的，所以选用了F调。" + LB +
                            "如果你觉得有难度的话，不如改成G调的和弦？当然，前提是你能再唱高一个音！",
                        score:
                        {
                            chords:
                            [
                                [[2, F], [4, F], [6, SPACE + Am], [8, A7], [10, Gm], [12, Gm], [14, SPACE + Dm], [16, Dm]],
                                [[2, F], [4, F], [6, SPACE + Am], [8, A7], [10, Gm], [12, C7], [15, F], [16, F]],
                                [[3, bB], [5, bB], [8, F], [9, C7], [12, bB], [14, bB], [17, F], [18, C]],
                                [[3, F], [5, F], [7, SPACE + Am], [9, A7], [11, Gm], [13, C7], [16, F]]
                            ],
                            lyrics:
                            [
                                "春风快加紧脚步 快到我窗前漫舞",
                                "春风请穿过门缝 请在我脸上轻吻",
                                "越过那千层的山峰 带给我亲切的问候",
                                "今年我们又再相逢 请给我新的祝福"
                            ],
                            outro: [bB, C, F]
                        },
                        postscript:
                            "F和<sup>b</sup>B还是用大横按比较好；尾奏中的C最好也横按，这样换弦方便些。",
                        demo: TAG.video, // Ep.19 4:31.2 ~ 5:20.9
                        comment:
                            "澎老师唱得真好啊，琴弹得更好！" + PB +
                            "右手大拇指扫弦？这个手法我没看懂，我也不会……" + LB +
                            "第3句里的C7似乎不是很好？而且换弦也不太方便。不如把前一个F再弹一次？"
                    },
                    ydgz:
                    {
                        h2: "一代公主",
                        preface: "《一代女皇》的谱子，就不提供了。",
                        score:
                        {
                            chords:
                            [
                                [[0, Am], [3, Em]],
                                [[0, Am], [3, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                                [[0, Am], [3, Em]],
                                [[0, Am], [3, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                                [[1, Dm7], [5, Am], [9, Em], [10, Em]],
                                [[1, Am], [5, Am7], [8, SPACE + Dm], [10, Dm]],
                                [[1, Dm7], [5, EmB], [8, GB], [10, GB]],
                                [[1, Dm7], [5, D6], [8, SPACE + G], [10, G]],
                                [[0, Am], [5, Em]],
                                [[0, Am], [5, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]]
                            ],
                            lyrics:
                            [
                                "峨眉 耸参天",
                                "丰颊 满光华",
                                "器宇非凡 是慧根",
                                "唐朝女皇 武则天",
                                "皓腕 刚毅扬",
                                "慧智 兰心巧",
                                "玉纤香动 万卷书",
                                "一代公主 封太平",
                                "春晖普照 溢满宫锦",
                                "女袭母风 展露威仪",
                                "寸寸柔肠 盈盈粉泪",
                                "冷暖人间 恩情几许",
                                "盘踞天下 数十年",
                                "郁郁笙歌 愈寂寥",
                                "两面评价 在人间",
                                "唐朝轶事 永流传"
                            ]
                        },
                        postscript: "最开心的是，我也能用上D6了耶！",
                        demo: TAG.audio
                    }
                }
            }
        }
    }
};
