var DATA =
{
    gequ:
    {
        language: "zh",
        nav: "歌曲",
        classification:
        {
            dalu:
            {
                nav: "大陆",
                header:
                {
                    h1: "大陆歌"
                },
                main:
                {
                    lsadm:
                    {
                        h2: "老鼠愛大米",
                        preface: "G调唱起来稍稍有点儿高？",
                        score:
                        {
                            chords:
                            [
                                [[3, G], [7, D], [11, Em], [15, SPACE + C]],
                                [[2, G], [5, C], [8, Am7], [12, D7]],
                                [[3, G], [7, D], [11, Em], [15, Bm]],
                                [[3, C], [7, D], [10, G], [11, G]],
                                [[3, Bm], [7, Em], [11, C], [13, D], [15, G]],
                                [[3, Bm], [7, Em], [12, Am7], [16, D7]],
                                [[3, Bm], [7, Em], [11, C], [13, D], [15, G]],
                                [[3, Bm], [7, Em], [11, Am7], [12, Am7], [15, D7], [16, D7]],
                                [[3, G], [7, SPACE + Em], [11, G], [15, Bm]],
                                [[3, C], [7, G], [12, Am], [16, D]],
                                [[3, G], [7, SPACE + Em], [11, G], [15, Bm]],
                                [[3, C], [7, G], [13, Am], [14, D], [18, G], [20, G]]
                            ],
                            lyrics:
                            [
                                "我听见你的声音 有种特别的感觉",
                                "让我不断想 不敢再忘记你",
                                "我记得有一个人 永远留在我心中",
                                "哪怕只能够这样的想你",
                                "如果真的有一天 爱情理想会实现",
                                "我会加倍努力好好对你 永远不改变",
                                "不管路有多么远 一定会让它实现",
                                "我会轻轻在你耳边对你说 对你说",
                                "我爱你 爱着你 就像老鼠爱大米",
                                "不管有多少风雨 我都会依然陪着你",
                                "我想你 想着你 不管有多么的苦",
                                "只要能让你开心 我什么都愿意 这样爱你"
                            ]
                        },
                        postscript:
                        [
                            "我好像改成F调来唱的，但和弦还是用的G调，知道我是怎么做到的吗？", PB,
                            "示范弹唱请参考",
                            [TAG.BoALP, "日语版", "uta", "nzmhkmgsk"],
                            "。"
                        ]
                    }
                }
            },
            xianggang:
            {
                nav: "香港",
                header:
                {
                    h1: "香港歌"
                },
                main:
                {
                    cchr:
                    {
                        h2: "叱咤红人",
                        preface: "G调唱起来稍稍有点儿高？",
                        score:
                        {
                            chords:
                            [
                                [[1, G], [8, SPACE + Em]],
                                [[1, Am], [8, SPACE + D]],
                                [[1, C], [7, G]],
                                [[1, Am7], [6, SPACE + D7]],
                                [[4, Bm], [8, Em]],
                                [[1, Am7], [5, SPACE + D]],
                                [[4, Bm], [8, Em]],
                                [[1, Am7], [6, D7]],
                                [[1, G], [6, Em]],
                                [[2, Am7], [8, SPACE + D7]],
                                [[3, G], [8, Em]],
                                [[4, C], [11, D], [17, Em], [18, Em]],
                                [[2, C], [6, D], [8, G]]
                            ],
                            lyrics:
                            [
                                "求其横掂做人最易",
                                "搭够当真自然之至",
                                "小流氓 变叱咤红人",
                                "搞搞震便当真",
                                "时运最高 任佢天冧落嚟",
                                "自会有新计",
                                "情分满泻 让我娶足七个",
                                "未会算多 齐共我唱歌",
                                "智慧 加啲气势",
                                "想要世界调转 亦未係难事",
                                "加啲放肆 加啲创意",
                                "一身充满少壮傲气 想痛快抉择博一次",
                                "我梗係放尽够胆试"
                            ]
                        },
                        postscript:
                        [
                            "我好像改成F调来唱的，但和弦还是用的G调，知道我是怎么做到的吗？", PB,
                            "D或D7都是凭感觉配的，好像还算和谐？等有空时再力求配得更精确些……"
                        ],
                        details: TAG.audio,
                        comment: "朋友们都说我唱得蛮好…… <^_^!>"
                    }
                }
            },
            taiwan:
            {
                nav: "台湾",
                header:
                {
                    h1: "台湾歌"
                },
                main:
                {///
//                    ldxyq:
//                    {
//                        h2: "ldxyq（新谱置顶）",
//                        preface:
//                        [
//                            "ldxyq", LB,
//                            "ldxyq"
//                        ],
//                        score:
//                        {
//                            chords:
//                            [
//                                [[2, F], [4, F], [6, SPACE + Am], [8, A7], [10, Gm], [12, Gm], [14, SPACE + Dm], [16, Dm]],
//                                [[2, F], [4, F], [6, SPACE + Am], [8, A7], [10, Gm], [12, C7], [15, F], [16, F]],
//                                [[3, bB], [5, bB], [8, F], [9, C7], [12, bB], [14, bB], [17, F], [18, C]],
//                                [[3, F], [5, F], [7, SPACE + Am], [9, A7], [11, Gm], [13, C7], [16, F]]
//                            ],
//                            lyrics:
//                            [
//                                "春风快加紧脚步 快到我窗前漫舞",
//                                "春风请穿过门缝 请在我脸上轻吻",
//                                "越过那千层的山峰 带给我亲切的问候",
//                                "今年我们又再相逢 请给我新的祝福"
//                            ]
//                        },
//                        postscript:
//                        [
//                            "ldxyq", LB,
//                            "尾奏中的C最好也大横按，这样换弦方便些。"
//                        ],
//                        details: TAG.video, // Ep.19 4:31.2 ~ 5:20.9
//                        comment:
//                        [
//                            "ldxyq", PB,
//                            "ldxyq", LB,
//                            "ldxyq"
//                        ]
//                    },
                    cf:
                    {
                        h2: "春风",
                        preface:
                        [
                            "因为是完全按照“陈天贵”的表演来记谱的，所以选用了F调。", LB,
                            "如果你觉得有难度的话，不如改成G调的和弦？当然，前提是你能再唱高一个音！"
                        ],
                        score:
                        {
                            chords:
                            [
                                [[2, F], [4, F], [6, SPACE + Am], [8, A7], [10, Gm], [12, Gm], [14, SPACE + Dm], [16, Dm]],
                                [[2, F], [4, F], [6, SPACE + Am], [8, A7], [10, Gm], [12, C7], [15, F], [16, F]],
                                [[3, bB], [5, bB], [8, F], [9, C7], [12, bB], [14, bB], [17, F], [18, C]],
                                [[3, F], [5, F], [7, SPACE + Am], [9, A7], [11, Gm], [13, C7], [16, F]]
                            ],
                            lyrics:
                            [
                                "春风快加紧脚步 快到我窗前漫舞",
                                "春风请穿过门缝 请在我脸上轻吻",
                                "越过那千层的山峰 带给我亲切的问候",
                                "今年我们又再相逢 请给我新的祝福"
                            ],
                            outro: [bB, C, F]
//                outro: [D7Fs, E7Gs,C, FmM7,F,bB]////////to be deleted after test!!!
                        },
                        postscript:
                        [
                            "F和",
                            [TAG.sup, "b"],
                            "B还是用大横按比较好。指力强劲的网友，如果能用双横按来按",
                            [TAG.sup, "b"],
                            "B，那当然最好！", LB,
                            "尾奏中的C最好也大横按，这样换弦方便些。"
                        ],
                        details: TAG.video, // Ep.19 4:31.2 ~ 5:20.9
                        comment:
                        [
                            "澎老师唱得真好啊，琴弹得更好！", PB,
                            "大拇指扫弦？这个手法没看懂……", LB,
                            "第3句里的C7似乎不是很好？而且换弦也不太方便。不如把前一个F再弹一次？"
                        ]
                    },
                    ydgz:
                    {
                        h2: "一代公主",
                        preface: "《一代女皇》就不提供了。",
                        score:
                        {
                            chords:
                            [
                                [[0, Am], [3, Em]],
                                [[0, Am], [3, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                                [[0, Am], [3, Em]],
                                [[0, Am], [3, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                                [[1, Dm7], [5, Am], [9, Em], [10, Em]],
                                [[1, Am], [5, Am7], [8, SPACE + Dm], [10, Dm]],
                                [[1, Dm7], [5, EmB], [8, GB], [10, GB]],
                                [[1, Dm7], [5, D6], [8, SPACE + G], [10, G]],
                                [[0, Am], [5, Em]],
                                [[0, Am], [5, G]],
                                [[0, Dm7], [5, GB], [8, Am]],
                                [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]]
                            ],
                            lyrics:
                            [
                                "峨眉 耸参天",
                                "丰颊 满光华",
                                "器宇非凡 是慧根",
                                "唐朝女皇 武则天",
                                "皓腕 刚毅扬",
                                "慧智 兰心巧",
                                "玉纤香动 万卷书",
                                "一代公主 封太平",
                                "春晖普照 溢满宫锦",
                                "女袭母风 展露威仪",
                                "寸寸柔肠 盈盈粉泪",
                                "冷暖人间 恩情几许",
                                "盘踞天下 数十年",
                                "郁郁笙歌 愈寂寥",
                                "两面评价 在人间",
                                "唐朝轶事 永流传"
                            ]
                        },
                        postscript: "最开心的是，能配上D6了耶！",
                        details: TAG.audio,
                        comment: "男声唱总是很怪哦？其实除了金老师，其他人唱出来都有点儿怪的。"
                    }
                }
            },
            xinjiapo:
            {
                nav: "新加坡",
                header:
                {
                    h1: "新加坡歌"
                },
                main:
                {
                    hqxjh:
                    {
                        h2: "豪情笑江湖（新谱置顶）",
                        preface: "主歌用A小调；副歌用C大调。",
                        score:
                        {
                            chords:
                            [
                                [[1, Am], [6, Dm]],
                                [[1, Cadd9], [5, Am]],
                                [[1, Am], [6, Em]],
                                [[1, DmF], [7, Em]],
                                [[1, Am], [7, sFm]],
                                [[1, F], [6, Am], [7, Em]],
                                [[1, Am], [7, GB]],
                                [[1, F], [7, G]],
                                [[3, C], [9, GB]],
                                [[3, Am], [9, Em]],
                                [[1, F], [7, EmB]],
                                [[1, Dm7], [7, G]],
                                [[3, C], [9, GB]],
                                [[3, Am], [9, Em]],
                                [[1, F], [7, EmB]],
                                [[1, Dm7], [5, G], [7, C]]
                            ],
                            lyrics:
                            [
                                "滚滚巨浪 红尘纷乱",
                                "淘尽英雄汉",
                                "笑里藏刀 人心难料",
                                "无奈世态皆炎凉",
                                "知音难寻访 痴心愁断肠",
                                "多情总被无情伤",
                                "风云多变幻 缘聚又缘散",
                                "浮生若梦一场欢",
                                "人生漫漫漫漫路遥长",
                                "看透繁华落尽见真章",
                                "豪情肝胆照 千杯醉难倒",
                                "伴我逐浪迎风笑",
                                "人生漫漫漫漫路遥长",
                                "看透繁华落尽见真章",
                                "豪情肝胆照 千杯醉难倒",
                                "伴我逐浪迎风笑"
                            ]
                        },
                        postscript:
                        [
                            "第一次使用Cadd9！效果好像还不错？之前也拆成C和Dm来演奏过，好像也是个不错的选择？", LB,
                            "把Dm/F换成F也行的。", LB,
                            [TAG.sup, "#"],
                            "Fm还有待推敲！其它候选的有D/F",
                            [TAG.sup, "#"],
                            "、D7/F",
                            [TAG.sup, "#"],
                            "……", LB,
                            "第6句里的Am和Em，用一个Am代替也行。不过此处用5级和弦来结束似乎更合理？但若合成一个Em/A又有点儿怪哦？所以就拆开吧！", LB,
                            "高潮前最后的G，可能用大横按比较好。"
                        ],
                        details: TAG.audio,
                    },
                    djdg:
                    {
                        h2: "对酒当歌",
                        preface: "C调唱起来有点儿低？若改弹D调的和弦呢，好像又有点儿怪？建议用变调夹。",
                        score:
                        {
                            chords:
                            [
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, Am]],
                                [[1, G], [7, C]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, Am]],
                                [[1, G], [7, C], [8, C7]],
                                [[1, Dm7], [6, Em]],
                                [[1, F], [6, SPACE + C]],
                                [[1, Dm7], [6, Em]],
                                [[1, F], [7, G]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, F]],
                                [[1, G], [7, C]],
                                [[1, C], [6, C]],
                                [[1, Dm], [7, G7]],
                                [[1, Dm7], [6, F]],
                                [[1, G], [7, C]]
                            ],
                            lyrics:
                            [
                                "路遥遥行遍万里山河",
                                "会知心能有几个",
                                "刀剑里笑看风云变色",
                                "谁胜谁负谁晓得",
                                "浪滔滔数尽悲欢离合",
                                "放得下能有几个",
                                "邀清风明月对酒当歌",
                                "醉三分悠然自得",
                                "不管今夕身处于何方",
                                "酒入肠豪情万丈",
                                "尽管世俗仍笑我痴狂",
                                "恩或怨都由我扛",
                                "天苍苍豪情气壮山河",
                                "得与失又算什么",
                                "刀剑里笑看风云变色",
                                "我行我素我自乐",
                                "人匆匆犹如红尘过客",
                                "名和利又算什么",
                                "邀清风明月对酒当歌",
                                "醉一回人生几何"
                            ]
                        },
                        postscript: "我没有变调夹，只好弹D调了，改了几个和弦。",
                        details: TAG.audio,
                        comment:
                        [
                            "想唱出那种洒脱的感觉，结果显得很杂耍 <^_^!>", PB,
                            "等心情好时再重录一次。"
                        ]
                    },
                    mtdfx:
                    {
                        h2: "明天的方向",
                        preface: "凭经验、凭感觉编配的，好像还算和谐？",
                        score:
                        {
                            chords:
                            [
                                [[0, C], [4, GB], [9, Am], [12, SPACE + Em]],
                                [[1, F], [7, CE], [11, Dm7], [12, SPACE + G]],
                                [[0, C], [4, GB], [8, Am], [12, SPACE + Em]],
                                [[1, F], [4, CE], [8, Dm7], [11, SPACE + G]],
                                [[0, C], [4, GB], [8, Am], [12, SPACE + Em]],
                                [[1, F], [7, CE], [10, Dm7], [11, SPACE + G]],
                                [[0, C], [4, GB], [8, Am], [12, SPACE + Em]],
                                [[1, F], [5, CE], [9, Dm7], [11, G], [13, SPACE + C]],
                                [[0, C7], [4, F], [8, G], [12, SPACE + C]],
                                [[0, C7], [4, SPACE + F], [8, SPACE + F], [10, G], [12, SPACE + C]],
                                [[0, C7], [4, F], [8, G], [12, SPACE + Em]],
                                [[0, Am], [3, D7], [7, F], [9, G], [13, C]],
                                [[0, C], [3, D7], [7, F], [9, G], [13, C]]
                            ],
                            lyrics:
                            [
                                "你我他肩并肩走在人生路上",
                                "去实现千百个幻梦中的理想",
                                "旅途中乐意接受无数的挑战",
                                "年轻的心灵才能逐渐成长",
                                "偶尔要面对失意挫折又何妨",
                                "让彼此一同把感受来分担",
                                "生活里不可缺少冲击的力量",
                                "有充实的生命才会活得不平凡",
                                "青春的骄傲写在朝气的脸庞",
                                "年少的喜悦常在眼波中流转",
                                "真挚的情感就是灿烂的阳光",
                                "留在心上照亮我们明天的方向",
                                "留在心上照亮我们明天的方向"
                            ]
                        },
                        postscript:
                        [
                            "最满意的是C7！", PB,
                            "高潮第2句也别花哨了，用和第1、3句一样的和弦，好像也是个不错的选择？"
                        ],
                    }
                }
            }
        }
    },
    uta:
    {
        language: "ja",
        nav: "うた",
        header:
        {
            h1: "日本語の歌"
        },
        main:
        {
            nzmhkmgsk:
            {
                h2: "ねずみは米がすき（新着）",
                preface:
                [
                    "日本の曲みたいわ！", PB,
                    "キーGで歌うなんて難しいかな？"
                ],
                score:
                {
                    chords:
                    [
                        [[3, G], [7, D], [11, Em], [15, SPACE + C]],
                        [[3, G], [6, C], [9, Am7], [13, D7]],
                        [[2, G], [6, D], [10, Em], [14, Bm]],
                        [[1, SPACE + C], [6, D], [8, G], [9, G]],
                        [[3, Bm], [6, Em], [9, C], [10, SPACE + SPACE + D], [12, G]],
                        [[2, Bm], [5, Em], [9, Am7 + SPACE], [12, D7]],
                        [[3, Bm], [7, Em], [10, C], [11, SPACE + SPACE + D], [13, G]],
                        [[3, Bm], [6, SPACE + Em], [10, Am7], [11, Am7], [15, D7], [16, D7]],
                        [[5, G], [10, SPACE + Em], [14, G], [18, Bm]],
                        [[3, C], [6, G], [10, Am], [14, D]],
                        [[6, G], [11, SPACE + Em], [15, G], [19, Bm]],
                        [[3, C], [7, G], [12, Am], [14, D], [18, G], [21, G]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞詞",
                        "なななななな ななななななな",
                        "しししししししし",
                        "歌歌歌歌歌歌 歌歌歌歌歌",
                        "詞詞詞詞詞詞詞詞詞詞詞詞",
                        "ななななななな ななななな",
                        "しししししししししし しししし",
                        "歌歌歌歌歌歌 歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞詞詞",
                        "ななななななな ななな ななななななな",
                        "ししししししし しししししし ししししし"
                    ]
                },
                postscript:
                [
                    "私はキーFで歌ったけど、上記どおりキーGのコードで弾いた……", LB,
                    "（手元にカポがない）"
                ],
                details: TAG.audio,
                comment:
                [
                    "オリジナルは",
                    [TAG.BoALP, "ここ", "gequ/dalu", "lsadm"],
                    "をクリックして！"
                ]
            },
            hdmrnut:
            {
                h2: "ひだまりの詩",
                preface: "曲名が読めるの？",
                score:
                {
                    chords:
                    [
                        [[2, C], [4, E7], [7, Am]],
                        [[1, EmG], [5, F], [7, G7], [11, C], [14, C]],
                        [[2, C], [4, E7], [6, Am]],
                        [[2, EmG], [6, F], [9, G7], [12, C], [13, C]],
                        [[1, SPACE + C], [3, E7], [6, Am]],
                        [[2, AmG], [6, F], [8, SPACE + G7], [12, C], [13, C]],
                        [[1, SPACE + C], [3, E7 + SPACE], [6, Am]],
                        [[1, SPACE + AmG], [3, D7Fs], [6, Gsus4], [8, G7], [10, G7]],
                        [[1, C], [3, Dm7], [5, Em7 + SPACE], [8, E7Gs], [10, SPACE + Am], [13, EmG], [15, SPACE + F], [18, FmM7]],
                        [[1, C], [3, Am], [5, SPACE + Dm7], [9, Gsus4]],
                        [[1, Em7], [3, Am], [5, SPACE + Dm7], [9, Gsus4]],
                        [[1, Em7], [3, Am], [5, Dm7], [9, Gsus4], [11, C]]
                    ],
                    lyrics:
                    [
                        "歌歌歌歌歌歌歌",
                        "詞詞詞詞詞 詞詞詞詞詞詞詞",
                        "なななななな",
                        "しししししし ししししし",
                        "歌歌歌歌歌歌",
                        "詞詞詞詞詞詞 詞詞詞詞詞",
                        "なななななな",
                        "ししし しししししし",
                        "歌歌歌歌歌歌歌歌歌歌 歌歌歌歌歌歌歌",
                        "詞詞詞 詞詞詞詞詞詞",
                        "ななな なななななな",
                        "ししし ししししししし"
                    ]
                },
                postscript:
                [
                    "E7/G",
                    [TAG.sup, "#"],
                    "は完璧だがね！", LB,
                    "最後のFは、標準的に押したほうがええ。他には代理コードでやってもええ。"
                ],
                details: TAG.audio,
                comment: "ガッキーに「よく知っとる」と言いたかったが、逆にそう言われた……"
            }
        }
    }/*,
    song:
    {
        language: "en",
        nav: "Song",
        classification:
        {}
    }*/
};
