var DATA =
{
    gequ:
    {
        nav: "歌曲",
        classification:
        {
            taiwan:
            {
                nav: "台湾",
                header:
                {
                    h1: "台湾歌"
                },
                main:
                {
                    ydgz:
                    {
                        h2: "一代公主",
                        chords:
                        [
                            [[0, Am], [3, Em]],
                            [[0, Am], [3, G]],
                            [[0, Dm7], [5, GB], [8, Am]],
                            [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                            [[0, Am], [3, Em]],
                            [[0, Am], [3, G]],
                            [[0, Dm7], [5, GB], [8, Am]],
                            [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]],
                            [[1, Dm7], [5, Am], [9, Em], [10, Em]],
                            [[1, Am], [5, Am7], [8, FullSpace + Dm], [10, Dm]],
                            [[1, Dm7], [5, EmB], [8, GB], [10, GB]],
                            [[1, Dm7], [5, D6], [9, G + FullSpace], [10, G]],
                            [[0, Am], [5, Em]],
                            [[0, Am], [5, G]],
                            [[0, Dm7], [5, GB], [8, Am]],
                            [[1, F], [3, Em], [5, Em], [6, Em], [8, Am], [9, Am]]
                        ],
                        lyrics:
                        [
                            "峨眉 耸参天",
                            "丰颊 满光华",
                            "器宇非凡 是慧根",
                            "唐朝女皇 武则天",
                            "皓腕 刚毅扬",
                            "慧智 兰心巧",
                            "玉纤香动 万卷书",
                            "一代公主 封太平",
                            "春晖普照 溢满宫锦",
                            "女袭母风 展露威仪",
                            "寸寸柔肠 盈盈粉泪",
                            "冷暖人间 恩情几许",
                            "盘踞天下 数十年",
                            "郁郁笙歌 愈寂寥",
                            "两面评价 在人间",
                            "唐朝轶事 永流传"
                        ]
                    }
                }
            }
        }
    }
};
